# 4차시 EDA : 수치형, 범주형 기술통계

### 01 Numpy

#### array

In [67]:
import numpy as np

In [68]:
np.array([1,2,3])

array([1, 2, 3])

In [69]:
np.array([[1,2], [3,4]])

array([[1, 2],
       [3, 4]])

In [70]:
np.array([1,2,3,4]).reshape(2, 2) # shape 변경

array([[1, 2],
       [3, 4]])

In [71]:
np.ones((2, 4)) # 1로 이뤄어진 array

array([[1., 1., 1., 1.],
       [1., 1., 1., 1.]])

In [72]:
array = np.array([[1,2,3], [4,5,6]])

In [73]:
array[0]

array([1, 2, 3])

In [74]:
array[1]

array([4, 5, 6])

In [75]:
array[0, :2]

array([1, 2])

In [76]:
array[0, 2]

3

In [77]:
array.ndim # array의 차원

2

In [78]:
array.shape # array의 shape

(2, 3)

In [79]:
array.dtype # array의 data type

dtype('int64')

In [80]:
array.sum()

21

In [81]:
array.min()

1

In [82]:
array.max()

6

In [83]:
array.mean()

3.5

In [84]:
array.std()

1.707825127659933

In [85]:
nums = np.array([1,2,2,3])

In [86]:
set(nums) # 집합 : 중복제거

{1, 2, 3}

In [87]:
np.unique(nums) # 중복제거

array([1, 2, 3])

In [88]:
len(nums)

4

In [89]:
np.arange(3, 8, 2)

array([3, 5, 7])

In [90]:
np.where(nums == 2, 1, 0) # 조건에 해당하면 1, 아니면 0

array([0, 1, 1, 0])

### 02 Pandas

#### Series

In [91]:
import pandas as pd

In [92]:
ser = pd.Series([1,2,3])
ser

0    1
1    2
2    3
dtype: int64

In [93]:
ser.values # value값 확인

array([1, 2, 3])

In [94]:
ser.index # index 확인

RangeIndex(start=0, stop=3, step=1)

In [95]:
pd.Series([1,2,3,3,4])

0    1
1    2
2    3
3    3
4    4
dtype: int64

In [96]:
pd.Series([1,2,3], index = ["a", 'b', 'c'])

a    1
b    2
c    3
dtype: int64

In [97]:
ser = pd.Series([1,2,3,3,4])
ser

0    1
1    2
2    3
3    3
4    4
dtype: int64

In [98]:
ser.sum()

13

In [99]:
ser.min()

1

In [100]:
ser.max()

4

In [101]:
ser.mean()

2.6

In [102]:
ser.std()

1.140175425099138

In [103]:
ser.skew() # 왜도

-0.404796008910937

In [104]:
ser.kurt() # 첨도

-0.17751479289941052

In [105]:
ser.unique() # 고유값(중복제거)

array([1, 2, 3, 4])

In [106]:
ser.idxmax() # 최대값의 index

4

In [107]:
ser.idxmin() # 최소값의 index

0

In [108]:
ser.isin([1,2]) # 1, 2를 포함하고 있는가

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [109]:
ser.isin([1,2]).sum() # 1, 2를 포함하고 있는 원소의 개수

2

In [110]:
ser = pd.Series([1,2,3,3,4])

In [111]:
ser[0]

1

In [112]:
ser[[1, 3]]

1    2
3    3
dtype: int64

In [113]:
ser[2:]

2    3
3    3
4    4
dtype: int64

In [114]:
ser[:3]

0    1
1    2
2    3
dtype: int64

In [115]:
ser[:-1]

0    1
1    2
2    3
3    3
dtype: int64

#### DataFrame

In [116]:
pd.DataFrame([[1,2,2], [3,3,4]])

   0  1  2
0  1  2  2
1  3  3  4

In [117]:
pd.DataFrame([[1,2], [3,4], [5,6]], columns = ["x", "y"])

   x  y
0  1  2
1  3  4
2  5  6

In [118]:
pd.DataFrame(np.arange(4).reshape((2,2)), columns = ['a', 'b'])

   a  b
0  0  1
1  2  3

In [119]:
df = pd.DataFrame({"aa" : [1,2,3], "bb" : [2,3,4]})
df

   aa  bb
0   1   2
1   2   3
2   3   4

In [120]:
df.aa

0    1
1    2
2    3
Name: aa, dtype: int64

In [121]:
df['aa']

0    1
1    2
2    3
Name: aa, dtype: int64

In [122]:
df['aa'[:2]]

0    1
1    2
2    3
Name: aa, dtype: int64

In [123]:
df.iloc[:, 0]

0    1
1    2
2    3
Name: aa, dtype: int64

In [124]:
df.loc[:, 'aa']

0    1
1    2
2    3
Name: aa, dtype: int64

In [125]:
df.iloc[:2, :]

   aa  bb
0   1   2
1   2   3

In [126]:
df.iloc[:, 0]

0    1
1    2
2    3
Name: aa, dtype: int64

In [127]:
df.loc[:, 'aa']

0    1
1    2
2    3
Name: aa, dtype: int64

In [128]:
pd.crosstab(df["aa"], df["bb"]) # crosstable(빈도표)

bb  2  3  4
aa
1   1  0  0
2   0  1  0
3   0  0  1

In [129]:
df.groupby("aa")['bb'].sum() # groupby

aa
1    2
2    3
3    4
Name: bb, dtype: int64

In [130]:
np.arange(6)

array([0, 1, 2, 3, 4, 5])

# 5차시 데이터 전처리 : 결측치, 이상치

### 결측치

In [181]:
import pandas as pd
df = pd.read_csv('iris_missing.csv')
df.head(7)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [151]:
df_na = df.head(7)
df_na

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

#### isna()

In [152]:
df_na["Sepal.Length"].isna() # isna()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
Name: Sepal.Length, dtype: bool

In [153]:
df_na['Sepal.Length'].notna() # notna()

0     True
1     True
2     True
3     True
4     True
5     True
6    False
Name: Sepal.Length, dtype: bool

In [154]:
df_na["Sepal.Length"].isna().sum() # 결측치 개수

1

In [155]:
df_na.isna()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False    False
3         False        False         False        False    False
4         False        False         False        False    False
5         False        False         False        False    False
6          True         True          True         True    False

In [156]:
df_na.isna().sum() # col 기준 결측치 개수

Sepal.Length    1
Sepal.Width     2
Petal.Length    2
Petal.Width     1
Species         0
dtype: int64

In [157]:
df_na.isna().sum(axis = 1) # row 기준 결측치 개수

0    2
1    0
2    0
3    0
4    0
5    0
6    4
dtype: int64

In [179]:
df.isna().sum().sum() # 결측치의 총 합

40

In [182]:
s_mean = df['Sepal.Width'].mean()
df = df.fillna(value = {'Sepal.width' : s_mean})  # Sepal.Width의 결측치를 평균대체
df['Sepal.Width'].var() # Sepal.Width의 분산

0.19240661227994849

#### fillna()

In [158]:
df_na.fillna(value = {"Sepal.Length" : 999, #fillna()
                     "Sepal.Width" : -999})

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1       -999.0           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6         999.0       -999.0           NaN          NaN  setosa

In [159]:
df_na.fillna(999)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1        999.0         999.0          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0         999.0        999.0  setosa

In [160]:
df_na["Sepal.Width"].mean()

3.3600000000000003

In [161]:
df_na.fillna(value = {'Sepal.Width' : df_na['Sepal.Width'].mean()}) # 평균대체

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1         3.36           NaN          0.2  setosa
1           4.9         3.00           1.4          0.2  setosa
2           4.7         3.20           1.3          0.2  setosa
3           4.6         3.10           1.5          0.2  setosa
4           5.0         3.60           1.4          0.2  setosa
5           5.4         3.90           1.7          0.4  setosa
6           NaN         3.36           NaN          NaN  setosa

In [162]:
df_na

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [163]:
df_na = df_na.fillna(value = {'Sepal.Width' : df_na['Sepal.Width'].mean()}) # 평균대체
df_na

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1         3.36           NaN          0.2  setosa
1           4.9         3.00           1.4          0.2  setosa
2           4.7         3.20           1.3          0.2  setosa
3           4.6         3.10           1.5          0.2  setosa
4           5.0         3.60           1.4          0.2  setosa
5           5.4         3.90           1.7          0.4  setosa
6           NaN         3.36           NaN          NaN  setosa

In [164]:
df_na2 = df.head(7)
df_na2

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [165]:
df.head(7)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

#### dropna()

In [166]:
df_na2.dropna() # 결측치가 하나라로 있는 row 제거

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [167]:
df_na2.dropna(how = 'all') # 모든 데이터가 결측치인 row 제거

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [168]:
df_na2.iloc[:, :-1]

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
6           NaN          NaN           NaN          NaN

In [169]:
df_na2.iloc[:, :-1].dropna(how = 'all')

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4

In [171]:
print(df['Sepal.Length'].max())
print(df['Sepal.Length'].min())
print(df['Sepal.Length'].mean())

7.9
4.3
5.8538461538461535

### 이상치

#### quantile

In [172]:
df['Sepal.Length'].quantile()

5.8

In [175]:
print(df['Sepal.Length'].quantile(0.25)) # 제 1 사분위수
print(df['Sepal.Length'].quantile(0.5)) # 제 2 사분위수
print(df['Sepal.Length'].quantile(0.75)) # 제 3 사분위수

5.1
5.8
6.4

In [212]:
iris = pd.read_csv('iris.csv')
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [213]:
SL_mean = iris['Sepal.Length'].mean()
SL_std = iris['Sepal.Length'].std()
iris_SL = iris['Sepal.Length'] # Sepal.Length에서 평균을 기준으로 1.5 std를 벗어나는 이상치의 개수
(iris_SL < SL_mean - 1.5 * SL_std).sum() + (iris_SL > SL_mean + 1.5 * SL_std).sum()

21

In [222]:
cond1 = iris['Sepal.Length'] < (SL_mean - 1.5 * SL_std)
cond2 = iris['Sepal.Length'] > (SL_mean + 1.5 * SL_std)
iris_out = iris.loc[(cond1) | (cond2), ] # Sepal.Length에서 평균을 기준으로 1.5 std를 벗어나는 이상치의 개수
len(iris_out)

21

In [203]:
print(SL_mean)
print(SL_std)

5.843333333333334
0.828066127977863

# 6차시 데이터 전처리 : 파생변수 생성

In [223]:
import pandas as pd
import numpy as np

In [224]:
df = pd.read_csv('iris.csv')
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

### np.where()

In [227]:
df['is_setosa'] = np.where(df['Species'] == 'setosa', 1, 0)
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species  is_setosa
0           5.1          3.5           1.4          0.2  setosa          1
1           4.9          3.0           1.4          0.2  setosa          1
2           4.7          3.2           1.3          0.2  setosa          1
3           4.6          3.1           1.5          0.2  setosa          1
4           5.0          3.6           1.4          0.2  setosa          1

In [228]:
df.tail()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa
145,6.7,3.0,5.2,2.3,virginica,0
146,6.3,2.5,5.0,1.9,virginica,0
147,6.5,3.0,5.2,2.0,virginica,0
148,6.2,3.4,5.4,2.3,virginica,0
149,5.9,3.0,5.1,1.8,virginica,0

In [230]:
pd.crosstab(df['Species'], df['is_setosa']).reset_index()

is_setosa     Species   0   1
0              setosa   0  50
1          versicolor  50   0
2           virginica  50   0

In [234]:
df['is_setosa_2'] = (df['Species'] == 'setosa') + 0 # True, False 값에 +0 또는 *1을 하여 숫자로 변환
df['is_setosa_3'] = (df['Species'] == 'setosa') * 1
df['is_setosa_4'] = (df['Species'] == 'setosa')
df.head()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3,is_setosa_4
0,5.1,3.5,1.4,0.2,setosa,1,1,1,True
1,4.9,3.0,1.4,0.2,setosa,1,1,1,True
2,4.7,3.2,1.3,0.2,setosa,1,1,1,True
3,4.6,3.1,1.5,0.2,setosa,1,1,1,True
4,5.0,3.6,1.4,0.2,setosa,1,1,1,True

In [235]:
df.tail()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3,is_setosa_4
145,6.7,3.0,5.2,2.3,virginica,0,0,0,False
146,6.3,2.5,5.0,1.9,virginica,0,0,0,False
147,6.5,3.0,5.2,2.0,virginica,0,0,0,False
148,6.2,3.4,5.4,2.3,virginica,0,0,0,False
149,5.9,3.0,5.1,1.8,virginica,0,0,0,False

### rename()

In [240]:
df.rename(columns = {'Sepal.Length' : 'SL'}, inplace = True)
df

,SL,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3,is_setosa_4
0,5.1,3.5,1.4,0.2,setosa,1,1,1,True
1,4.9,3.0,1.4,0.2,setosa,1,1,1,True
2,4.7,3.2,1.3,0.2,setosa,1,1,1,True
3,4.6,3.1,1.5,0.2,setosa,1,1,1,True
4,5.0,3.6,1.4,0.2,setosa,1,1,1,True
...,...,...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0,0,0,False
146,6.3,2.5,5.0,1.9,virginica,0,0,0,False
147,6.5,3.0,5.2,2.0,virginica,0,0,0,False
148,6.2,3.4,5.4,2.3,virginica,0,0,0,False
149,5.9,3.0,5.1,1.8,virginica,0,0,0,False

### apply()

In [242]:
bike = pd.read_csv('bike.csv')
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [243]:
bike.columns

Index(['datetime', 'season', 'holiday', 'workingday', 'weather', 'temp',
       'atemp', 'humidity', 'windspeed', 'casual', 'registered', 'count'],
      dtype='object')

In [244]:
bike_sub = bike.iloc[:4, 9:11]
bike_sub

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10

In [247]:
bike_sub = bike.loc[:4, 'casual' : 'registered']
bike_sub

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1

In [250]:
bike_sub.apply(func = sum) # 함수를 col 기준으로 적용

casual        19
registered    83
dtype: int64

In [251]:
bike_sub.apply(func = sum, axis = 1) # 함수를 row 기준으로 적용

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [252]:
bike_sub.mean()

casual         3.8
registered    16.6
dtype: float64

In [254]:
bike_sub.apply(func = pd.Series.mean)

casual         3.8
registered    16.6
dtype: float64

### lambda 함수

In [255]:
bike_sub.apply(func = lambda x :
                      round(x.mean()))

casual         4
registered    17
dtype: int64

### astype

In [257]:
bike_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   casual      5 non-null      int64
 1   registered  5 non-null      int64
dtypes: int64(2)
memory usage: 208.0 bytes

In [261]:
bike_sub['casual']

0    3
1    8
2    5
3    3
4    0
Name: casual, dtype: int64

In [262]:
bike_sub['casual'].astype(str) + '대'

0    3대
1    8대
2    5대
3    3대
4    0대
Name: casual, dtype: object

In [263]:
bike.head(3)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32

### str.slice()

In [264]:
bike['datetime'][:3]

0    2011-01-01 00:00:00
1    2011-01-01 01:00:00
2    2011-01-01 02:00:00
Name: datetime, dtype: object

In [267]:
bike['datetime'][:3].str.slice(0,4)

0    2011
1    2011
2    2011
Name: datetime, dtype: object

In [268]:
bike['datetime'][:3].str.slice(5, 7)

0    01
1    01
2    01
Name: datetime, dtype: object

### pd.to_datetime()

In [269]:
bike_time = pd.to_datetime(bike['datetime'][:3])
bike_time

0   2011-01-01 00:00:00
1   2011-01-01 01:00:00
2   2011-01-01 02:00:00
Name: datetime, dtype: datetime64[ns]

In [270]:
bike_time.dt.year

0    2011
1    2011
2    2011
Name: datetime, dtype: int64

In [271]:
bike_time.dt.month

0    1
1    1
2    1
Name: datetime, dtype: int64

In [272]:
bike_time.dt.day

0    1
1    1
2    1
Name: datetime, dtype: int64

In [275]:
bike_time.dt.hour

0    0
1    1
2    2
Name: datetime, dtype: int64

In [276]:
bike_time.dt.weekday

0    5
1    5
2    5
Name: datetime, dtype: int64

In [280]:
bike_time.dt.

0    5
1    5
2    5
Name: datetime, dtype: int64

In [283]:
import datetime

In [285]:
datetime.date(2011,1,3).isocalendar()

(2011, 1, 1)

In [286]:
import calendar
print(calendar.calendar(2011))

                                  2011

      January                   February                   March
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
                1  2          1  2  3  4  5  6          1  2  3  4  5  6
 3  4  5  6  7  8  9       7  8  9 10 11 12 13       7  8  9 10 11 12 13
10 11 12 13 14 15 16      14 15 16 17 18 19 20      14 15 16 17 18 19 20
17 18 19 20 21 22 23      21 22 23 24 25 26 27      21 22 23 24 25 26 27
24 25 26 27 28 29 30      28                        28 29 30 31
31

       April                      May                       June
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
             1  2  3                         1             1  2  3  4  5
 4  5  6  7  8  9 10       2  3  4  5  6  7  8       6  7  8  9 10 11 12
11 12 13 14 15 16 17       9 10 11 12 13 14 15      13 14 15 16 17 18 19
18 19 20 21 22 23 24      16 17 18 19 20 21 22      20 21 22 23 24 25 26
25 26 27 28 29 30         23 24 25 26 27 28 29      27 28 29 30
                          30 31

        July                     August                  September
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
             1  2  3       1  2  3  4  5  6  7                1  2  3  4
 4  5  6  7  8  9 10       8  9 10 11 12 13 14       5  6  7  8  9 10 11
11 12 13 14 15 16 17      15 16 17 18 19 20 21      12 13 14 15 16 17 18
18 19 20 21 22 23 24      22 23 24 25 26 27 28      19 20 21 22 23 24 25
25 26 27 28 29 30 31      29 30 31                  26 27 28 29 30

      October                   November                  December
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
                1  2          1  2  3  4  5  6                1  2  3  4
 3  4  5  6  7  8  9       7  8  9 10 11 12 13       5  6  7  8  9 10 11
10 11 12 13 14 15 16      14 15 16 17 18 19 20      12 13 14 15 16 17 18
17 18 19 20 21 22 23      21 22 23 24 25 26 27      19 20 21 22 23 24 25
24 25 26 27 28 29 30      28 29 30                  26 27 28 29 30 31
31

### pd.get_dummies()

In [290]:
bike.head(10)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1
5,2011-01-01 05:00:00,1,0,0,2,9.84,12.880,75,6.0032,0,1,1
6,2011-01-01 06:00:00,1,0,0,1,9.02,13.635,80,0.0000,2,0,2
7,2011-01-01 07:00:00,1,0,0,1,8.20,12.880,86,0.0000,1,2,3
8,2011-01-01 08:00:00,1,0,0,1,9.84,14.395,75,0.0000,1,7,8
9,2011-01-01 09:00:00,1,0,0,1,13.12,17.425,76,0.0000,8,6,14

In [296]:
bike_dum = pd.get_dummies(data = bike, columns = ['season'], # season에 대한 가변수 생성
                         drop_first = True) # 첫 번째 가변수 삭제
bike_dum.head(10)

,datetime,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_2,season_3,season_4
0,2011-01-01 00:00:00,0,0,1,9.84,14.395,81,0.0000,3,13,16,0,0,0
1,2011-01-01 01:00:00,0,0,1,9.02,13.635,80,0.0000,8,32,40,0,0,0
2,2011-01-01 02:00:00,0,0,1,9.02,13.635,80,0.0000,5,27,32,0,0,0
3,2011-01-01 03:00:00,0,0,1,9.84,14.395,75,0.0000,3,10,13,0,0,0
4,2011-01-01 04:00:00,0,0,1,9.84,14.395,75,0.0000,0,1,1,0,0,0
5,2011-01-01 05:00:00,0,0,2,9.84,12.880,75,6.0032,0,1,1,0,0,0
6,2011-01-01 06:00:00,0,0,1,9.02,13.635,80,0.0000,2,0,2,0,0,0
7,2011-01-01 07:00:00,0,0,1,8.20,12.880,86,0.0000,1,2,3,0,0,0
8,2011-01-01 08:00:00,0,0,1,9.84,14.395,75,0.0000,1,7,8,0,0,0
9,2011-01-01 09:00:00,0,0,1,13.12,17.425,76,0.0000,8,6,14,0,0,0

In [323]:
bike = pd.read_csv('bike.csv')
abs(bike['temp'] - bike['atemp']).mean().round(3) # bike['temp']와 bike[atemp]의 차이의 절대값의 평균

3.509

In [324]:
bike['datetime'] = pd.to_datetime(bike['datetime']) # bike['datetime']을 time data로 변환
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [325]:
bike['date'] = bike['datetime'].dt.date # 년월일을 담은 bike['date'] 생성
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,date
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,2011-01-01
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,2011-01-01

In [326]:
bike_agg = bike.groupby('date')['casual'].max() # date를 기준으로 groupby한 후 casual의 최대값 확인
bike_agg

date
2011-01-01    47
2011-01-02    20
2011-01-03    14
2011-01-04    18
2011-01-05    12
              ..
2012-12-15    95
2012-12-16    67
2012-12-17    22
2012-12-18    58
2012-12-19    37
Name: casual, Length: 456, dtype: int64

In [327]:
(bike_agg > 25).sum() # 일별 casual의 최대값이 25 초과인 날짜 개수

384

In [331]:
bike['hour'] = bike['datetime'].dt.hour # 시간을 담은 bike['hour'] 생성
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,date,hour
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,2011-01-01,0
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,2011-01-01,1
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32,2011-01-01,2
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13,2011-01-01,3
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1,2011-01-01,4

In [333]:
bike.groupby('hour')['registered'].mean() # hour을 기준으로 groupby한 후 registered의 평균

hour
0      44.826374
1      27.345815
2      18.080357
3       9.076212
4       5.144796
5      18.311947
6      72.109890
7     202.202198
8     341.226374
9     190.824176
10    128.973626
11    150.621978
12    187.677632
13    183.728070
14    166.853070
15    178.269737
16    241.289474
17    393.324561
18    369.462719
19    266.203947
20    191.785088
21    144.802632
22    110.973684
23     74.046053
Name: registered, dtype: float64

In [335]:
bike.groupby('hour')['registered'].mean().max() # hour을 기준으로 groupby한 후 registered의 평균의 최대값

393.32456140350877

In [336]:
bike.groupby('hour')['registered'].mean().idxmax() # 최대값의 인덱스

17

# 7차시 데이터 전처리 : 데이터 병합

### reset_index()

In [338]:
import pandas as pd
bike = pd.read_csv('bike.csv')
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [340]:
bike_sub = bike.sample(n = 4, random_state = 132) # bike에서 4개 랜덤추출
bike_sub

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
3693,2011-09-04 19:00:00,3,0,0,1,30.34,34.850,70,12.9980,178,150,328
7276,2012-05-02 13:00:00,2,0,1,2,23.78,27.275,78,12.9980,49,179,228
9218,2012-09-07 11:00:00,3,0,1,1,31.16,35.605,62,8.9981,81,215,296
802,2011-02-16 21:00:00,1,0,1,1,14.76,17.425,46,12.9980,5,87,92

In [341]:
bike_sub.reset_index() # 이전 인덱스를 포함

,index,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,3693,2011-09-04 19:00:00,3,0,0,1,30.34,34.850,70,12.9980,178,150,328
1,7276,2012-05-02 13:00:00,2,0,1,2,23.78,27.275,78,12.9980,49,179,228
2,9218,2012-09-07 11:00:00,3,0,1,1,31.16,35.605,62,8.9981,81,215,296
3,802,2011-02-16 21:00:00,1,0,1,1,14.76,17.425,46,12.9980,5,87,92

In [342]:
bike_sub.reset_index(drop = True) # 이전 인덱스 부분 삭제

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-09-04 19:00:00,3,0,0,1,30.34,34.850,70,12.9980,178,150,328
1,2012-05-02 13:00:00,2,0,1,2,23.78,27.275,78,12.9980,49,179,228
2,2012-09-07 11:00:00,3,0,1,1,31.16,35.605,62,8.9981,81,215,296
3,2011-02-16 21:00:00,1,0,1,1,14.76,17.425,46,12.9980,5,87,92

In [343]:
bike_sub.reset_index(drop = True, inplace = True) # 이전 인덱스 부분 삭제, 원본 파일도 변경
bike_sub

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-09-04 19:00:00,3,0,0,1,30.34,34.850,70,12.9980,178,150,328
1,2012-05-02 13:00:00,2,0,1,2,23.78,27.275,78,12.9980,49,179,228
2,2012-09-07 11:00:00,3,0,1,1,31.16,35.605,62,8.9981,81,215,296
3,2011-02-16 21:00:00,1,0,1,1,14.76,17.425,46,12.9980,5,87,92

### set_index()

In [345]:
bike_sub.set_index('datetime') # datetime을 인덱스로 지정

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
datetime,,,,,,,,,,,
2011-09-04 19:00:00,3,0,0,1,30.34,34.850,70,12.9980,178,150,328
2012-05-02 13:00:00,2,0,1,2,23.78,27.275,78,12.9980,49,179,228
2012-09-07 11:00:00,3,0,1,1,31.16,35.605,62,8.9981,81,215,296
2011-02-16 21:00:00,1,0,1,1,14.76,17.425,46,12.9980,5,87,92

### binding(바인딩)

#### pd.concat()

In [348]:
bike_1 = bike.iloc[:3, :4]
bike_2 = bike.iloc[5:8, :4]
print(len(bike_1))
print(len(bike_2))

3
3

In [349]:
bike_1

              datetime  season  holiday  workingday
0  2011-01-01 00:00:00       1        0           0
1  2011-01-01 01:00:00       1        0           0
2  2011-01-01 02:00:00       1        0           0

In [350]:
bike_2

              datetime  season  holiday  workingday
5  2011-01-01 05:00:00       1        0           0
6  2011-01-01 06:00:00       1        0           0
7  2011-01-01 07:00:00       1        0           0

In [352]:
pd.concat([bike_1, bike_2]) # row(행) 기준으로 binding

              datetime  season  holiday  workingday
0  2011-01-01 00:00:00       1        0           0
1  2011-01-01 01:00:00       1        0           0
2  2011-01-01 02:00:00       1        0           0
5  2011-01-01 05:00:00       1        0           0
6  2011-01-01 06:00:00       1        0           0
7  2011-01-01 07:00:00       1        0           0

In [354]:
pd.concat([bike_1, bike_2], axis = 1) # col(열) 기준으로 binding

,datetime,season,holiday,workingday,datetime,season,holiday,workingday
0,2011-01-01 00:00:00,1.0,0.0,0.0,NaN,NaN,NaN,NaN
1,2011-01-01 01:00:00,1.0,0.0,0.0,NaN,NaN,NaN,NaN
2,2011-01-01 02:00:00,1.0,0.0,0.0,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,2011-01-01 05:00:00,1.0,0.0,0.0
6,NaN,NaN,NaN,NaN,2011-01-01 06:00:00,1.0,0.0,0.0
7,NaN,NaN,NaN,NaN,2011-01-01 07:00:00,1.0,0.0,0.0

In [358]:
pd.concat([bike_1.reset_index(drop = True), bike_2.reset_index(drop = True)], axis = 1) # col(열) 기준으로 binding
                                        # 인덱스를 초기화하여 binding하는 두 df의 인덱스를 같아지도록 만든다

,datetime,season,holiday,workingday,datetime,season,holiday,workingday
0,2011-01-01 00:00:00,1,0,0,2011-01-01 05:00:00,1,0,0
1,2011-01-01 01:00:00,1,0,0,2011-01-01 06:00:00,1,0,0
2,2011-01-01 02:00:00,1,0,0,2011-01-01 07:00:00,1,0,0

### join

#### pd.merge()

In [360]:
df_a = pd.read_csv('join_data_group_members.csv')
df_b = pd.read_csv('join_data_member_room.csv')
df_a.head()

    team    No member
0  TWICE  1414     미나
1  TWICE  1462     나연
2  TWICE  1178     다현
3  TWICE  1525     정연
4  TWICE  1194     지효

In [361]:
df_b.head()

   floor  room name
0      3  3G-A   미나
1      3  3G-B   나연
2      3  3G-C   다현
3      4  4G-A   정연
4      4  4G-B   지효

In [365]:
pd.merge(left = df_a, right = df_b, # df_a['member'], df_b['name']을 기준으로 join
        left_on = 'member', right_on = 'name',
        how = 'inner') # 교집합인 부분만

    team    No member  floor  room name
0  TWICE  1414     미나      3  3G-A   미나
1  TWICE  1462     나연      3  3G-B   나연
2  TWICE  1178     다현      3  3G-C   다현
3  TWICE  1525     정연      4  4G-A   정연
4  TWICE  1194     지효      4  4G-B   지효
5  TWICE  1937     채연      4  4G-C   채연
6  TWICE  1817     모모      5  5G-A   모모
7  TWICE  1117     쯔위      5  5G-B   쯔위
8  TWICE  1298     사나      5  5G-C   사나

In [367]:
pd.merge(left = df_a, right = df_b, # df_a['member'], df_b['name']을 기준으로 join
        left_on = 'member', right_on = 'name',
        how = 'left') # left는 그대로 있고 그에 맞춰서 right를 join

          team    No member  floor  room name
0        TWICE  1414     미나    3.0  3G-A   미나
1        TWICE  1462     나연    3.0  3G-B   나연
2        TWICE  1178     다현    3.0  3G-C   다현
3        TWICE  1525     정연    4.0  4G-A   정연
4        TWICE  1194     지효    4.0  4G-B   지효
5        TWICE  1937     채연    4.0  4G-C   채연
6        TWICE  1817     모모    5.0  5G-A   모모
7        TWICE  1117     쯔위    5.0  5G-B   쯔위
8        TWICE  1298     사나    5.0  5G-C   사나
9   Red Velvet  1228    아이린    NaN   NaN  NaN
10  Red Velvet  1243     웬디    NaN   NaN  NaN
11  Red Velvet  1013     슬기    NaN   NaN  NaN
12  Red Velvet  1373     조이    NaN   NaN  NaN
13  Red Velvet  1664     예리    NaN   NaN  NaN

In [368]:
pd.merge(left = df_a, right = df_b, # df_a['member'], df_b['name']을 기준으로 join
        left_on = 'member', right_on = 'name',
        how = 'right') # right는 그대로 있고 그에 맞춰서 left를 join

    team    No member  floor  room name
0  TWICE  1414     미나      3  3G-A   미나
1  TWICE  1462     나연      3  3G-B   나연
2  TWICE  1178     다현      3  3G-C   다현
3  TWICE  1525     정연      4  4G-A   정연
4  TWICE  1194     지효      4  4G-B   지효
5  TWICE  1937     채연      4  4G-C   채연
6  TWICE  1817     모모      5  5G-A   모모
7  TWICE  1117     쯔위      5  5G-B   쯔위
8  TWICE  1298     사나      5  5G-C   사나

In [377]:
A = pd.read_csv('join_data_group_members.csv')
B = pd.read_csv('join_data_member_room.csv')
AB = pd.merge(A,B, left_on = 'member', right_on = 'name', how = 'left')
AB.isna().sum(axis = 1).sum()

15

In [380]:
AB.isna().sum()

team      0
No        0
member    0
floor     5
room      5
name      5
dtype: int64

In [386]:
bike = pd.read_csv('bike.csv')
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [387]:
bike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   datetime    10886 non-null  object
 1   season      10886 non-null  int64
 2   holiday     10886 non-null  int64
 3   workingday  10886 non-null  int64
 4   weather     10886 non-null  int64
 5   temp        10886 non-null  float64
 6   atemp       10886 non-null  float64
 7   humidity    10886 non-null  int64
 8   windspeed   10886 non-null  float64
 9   casual      10886 non-null  int64
 10  registered  10886 non-null  int64
 11  count       10886 non-null  int64
dtypes: float64(3), int64(8), object(1)
memory usage: 1020.7+ KB

In [388]:
bike['datetime'] = pd.to_datetime(bike['datetime'])

In [389]:
bike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   datetime    10886 non-null  datetime64[ns]
 1   season      10886 non-null  int64
 2   holiday     10886 non-null  int64
 3   workingday  10886 non-null  int64
 4   weather     10886 non-null  int64
 5   temp        10886 non-null  float64
 6   atemp       10886 non-null  float64
 7   humidity    10886 non-null  int64
 8   windspeed   10886 non-null  float64
 9   casual      10886 non-null  int64
 10  registered  10886 non-null  int64
 11  count       10886 non-null  int64
dtypes: datetime64[ns](1), float64(3), int64(8)
memory usage: 1020.7 KB

In [392]:
bike['hour'] = bike['datetime'].dt.hour
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,hour
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,0
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,1
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32,2
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13,3
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1,4

In [393]:
bike_s = bike[bike['season'] == 2]
bike_w = bike[bike['season'] == 4]

In [395]:
bike_s.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,hour
1323,2011-04-01 00:00:00,2,0,1,3,10.66,12.880,100,11.0014,0,6,6,0
1324,2011-04-01 01:00:00,2,0,1,3,10.66,12.880,100,11.0014,0,4,4,1
1325,2011-04-01 02:00:00,2,0,1,3,10.66,12.880,93,12.9980,0,7,7,2
1326,2011-04-01 03:00:00,2,0,1,2,9.84,11.365,93,16.9979,0,4,4,3
1327,2011-04-01 04:00:00,2,0,1,2,9.84,11.365,93,16.9979,0,3,3,4

In [396]:
bike_w.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,hour
4055,2011-10-01 00:00:00,4,0,0,1,20.50,24.240,63,26.0027,24,106,130,0
4056,2011-10-01 01:00:00,4,0,0,1,19.68,23.485,67,22.0028,11,47,58,1
4057,2011-10-01 02:00:00,4,0,0,1,18.86,22.725,63,27.9993,21,46,67,2
4058,2011-10-01 03:00:00,4,0,0,1,18.86,22.725,59,27.9993,8,17,25,3
4059,2011-10-01 04:00:00,4,0,0,1,18.04,21.970,58,27.9993,2,6,8,4

In [402]:
bike_s_m = bike_s.groupby('hour')['registered'].mean()
bike_w_m = bike_w.groupby('hour')['registered'].mean()

In [405]:
abs(bike_s_m - bike_w_m).idxmax()

19

In [440]:
bike = pd.read_csv('bike.csv')
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [441]:
bike['datetime'] = pd.to_datetime(bike['datetime'])

In [442]:
bike['date'] = bike['datetime'].dt.date
bike['hour'] = bike['datetime'].dt.hour

In [443]:
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,date,hour
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,2011-01-01,0
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,2011-01-01,1
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32,2011-01-01,2
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13,2011-01-01,3
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1,2011-01-01,4

In [444]:
bike_h100 = bike.groupby(['date'])['humidity'].max().reset_index()
bike_h100.head()

         date  humidity
0  2011-01-01        94
1  2011-01-02       100
2  2011-01-03        69
3  2011-01-04        74
4  2011-01-05        74

In [445]:
bike_h100 = bike_h100[bike_h100['humidity'] == 100]
bike_h100.head()

          date  humidity
1   2011-01-02       100
20  2011-02-02       100
23  2011-02-05       100
25  2011-02-07       100
42  2011-03-05       100

In [446]:
len(bike_h100)

40

In [447]:
bike_join = pd.merge(bike_h100, bike, left_on = 'date', right_on = 'date', how = 'inner')
bike_join.head()

,date,humidity_x,datetime,season,holiday,workingday,weather,temp,atemp,humidity_y,windspeed,casual,registered,count,hour
0,2011-01-02,100,2011-01-02 00:00:00,1,0,0,2,18.86,22.725,88,19.9995,4,13,17,0
1,2011-01-02,100,2011-01-02 01:00:00,1,0,0,2,18.04,21.970,94,16.9979,1,16,17,1
2,2011-01-02,100,2011-01-02 02:00:00,1,0,0,2,17.22,21.210,100,19.0012,1,8,9,2
3,2011-01-02,100,2011-01-02 03:00:00,1,0,0,2,18.86,22.725,94,12.9980,2,4,6,3
4,2011-01-02,100,2011-01-02 04:00:00,1,0,0,2,18.86,22.725,94,12.9980,2,1,3,4

In [449]:
bike_join_temp30 = bike_join.loc[bike_join['temp'] > 30, ]
bike_join_temp30.head()

,date,humidity_x,datetime,season,holiday,workingday,weather,temp,atemp,humidity_y,windspeed,casual,registered,count,hour
297,2011-04-11,100,2011-04-11 15:00:00,2,0,1,1,30.34,33.335,48,35.0008,56,85,141,15
298,2011-04-11,100,2011-04-11 16:00:00,2,0,1,1,30.34,33.335,48,35.0008,73,162,235,16
299,2011-04-11,100,2011-04-11 17:00:00,2,0,1,1,30.34,33.335,48,35.0008,100,352,452,17
487,2011-06-17,100,2011-06-17 13:00:00,2,0,1,1,30.34,34.090,62,19.0012,48,156,204,13
488,2011-06-17,100,2011-06-17 14:00:00,2,0,1,1,31.16,34.850,52,12.9980,73,142,215,14

In [452]:
bike_join_temp30['count'].mean()

338.75

# 8차시 데이터 전처리 : 정렬 및 변환

In [2]:
import pandas as pd
dia = pd.read_csv('diamonds.csv')
dia.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

### pd.crosstab()

In [3]:
pd.crosstab(dia['cut'], dia['clarity']) # 빈도표

clarity     I1    IF   SI1   SI2   VS1   VS2  VVS1  VVS2
cut
Fair       210     9   408   466   170   261    17    69
Good        96    71  1560  1081   648   978   186   286
Ideal      146  1212  4282  2598  3589  5071  2047  2606
Premium    205   230  3575  2949  1989  3357   616   870
Very Good   84   268  3240  2100  1775  2591   789  1235

In [5]:
pd.crosstab(dia['cut'], dia['clarity'], normalize = True)

clarity,I1,IF,SI1,SI2,VS1,VS2,VVS1,VVS2
cut,,,,,,,,
Fair,0.003893,0.000167,0.007564,0.008639,0.003152,0.004839,0.000315,0.001279
Good,0.001780,0.001316,0.028921,0.020041,0.012013,0.018131,0.003448,0.005302
Ideal,0.002707,0.022469,0.079385,0.048165,0.066537,0.094012,0.037950,0.048313
Premium,0.003801,0.004264,0.066277,0.054672,0.036874,0.062236,0.011420,0.016129
Very Good,0.001557,0.004968,0.060067,0.038932,0.032907,0.048035,0.014627,0.022896

In [7]:
pd.crosstab(dia['cut'], dia['clarity'], normalize = True).round(2)

clarity     I1    IF   SI1   SI2   VS1   VS2  VVS1  VVS2
cut
Fair       0.0  0.00  0.01  0.01  0.00  0.00  0.00  0.00
Good       0.0  0.00  0.03  0.02  0.01  0.02  0.00  0.01
Ideal      0.0  0.02  0.08  0.05  0.07  0.09  0.04  0.05
Premium    0.0  0.00  0.07  0.05  0.04  0.06  0.01  0.02
Very Good  0.0  0.00  0.06  0.04  0.03  0.05  0.01  0.02

In [12]:
pd.crosstab(dia['cut'], dia['clarity'], normalize = 0) # 각 row를 더하면 1

clarity,I1,IF,SI1,SI2,VS1,VS2,VVS1,VVS2
cut,,,,,,,,
Fair,0.130435,0.005590,0.253416,0.289441,0.105590,0.162112,0.010559,0.042857
Good,0.019568,0.014472,0.317978,0.220342,0.132083,0.199348,0.037913,0.058296
Ideal,0.006775,0.056239,0.198691,0.120551,0.166535,0.235302,0.094984,0.120922
Premium,0.014865,0.016678,0.259227,0.213835,0.144224,0.243420,0.044667,0.063085
Very Good,0.006952,0.022182,0.268168,0.173812,0.146913,0.214451,0.065304,0.102218

In [13]:
pd.crosstab(dia['cut'], dia['clarity'], normalize = 0).sum(axis = 1)

cut
Fair         1.0
Good         1.0
Ideal        1.0
Premium      1.0
Very Good    1.0
dtype: float64

In [15]:
pd.crosstab(dia['cut'], dia['clarity'], normalize = 1) # 각 col을 더하면 1

clarity,I1,IF,SI1,SI2,VS1,VS2,VVS1,VVS2
cut,,,,,,,,
Fair,0.283401,0.005028,0.031228,0.050685,0.020805,0.021292,0.004651,0.013620
Good,0.129555,0.039665,0.119403,0.117577,0.079305,0.079785,0.050889,0.056455
Ideal,0.197031,0.677095,0.327746,0.282576,0.439236,0.413689,0.560055,0.514410
Premium,0.276653,0.128492,0.273632,0.320753,0.243422,0.273862,0.168536,0.171733
Very Good,0.113360,0.149721,0.247991,0.228410,0.217232,0.211372,0.215869,0.243782

In [16]:
pd.crosstab(dia['cut'], dia['clarity'], normalize = 1).sum(axis = 0)

clarity
I1      1.0
IF      1.0
SI1     1.0
SI2     1.0
VS1     1.0
VS2     1.0
VVS1    1.0
VVS2    1.0
dtype: float64

#### aggfunc

In [19]:
pd.crosstab(dia['cut'], dia['clarity'], # dia['cut'], dia['clarity']의 빈도표 기준으로
            values = dia['price'], aggfunc = pd.Series.mean) # dia['price']의 평균

clarity,I1,IF,SI1,SI2,VS1,VS2,VVS1,VVS2
cut,,,,,,,,
Fair,3703.533333,1912.333333,4208.279412,5173.916309,4165.141176,4174.724138,3871.352941,3349.768116
Good,3596.635417,4098.323944,3689.533333,4580.260870,3801.445988,4262.236196,2254.774194,3079.108392
Ideal,4335.726027,2272.913366,3752.118169,4755.952656,3489.744497,3284.550385,2468.129458,3250.290100
Premium,3947.331707,3856.143478,4455.269371,5545.936928,4485.462041,4550.331248,2831.206169,3795.122989
Very Good,4078.226190,4396.216418,3932.391049,4988.688095,3805.353239,4215.759552,2459.441065,3037.765182

In [21]:
dia.groupby(['cut', 'clarity'])['price'].mean().reset_index() # 위와 자료구조는 다르지만 같은 결과

          cut clarity        price
0        Fair      I1  3703.533333
1        Fair      IF  1912.333333
2        Fair     SI1  4208.279412
3        Fair     SI2  5173.916309
4        Fair     VS1  4165.141176
5        Fair     VS2  4174.724138
6        Fair    VVS1  3871.352941
7        Fair    VVS2  3349.768116
8        Good      I1  3596.635417
9        Good      IF  4098.323944
10       Good     SI1  3689.533333
11       Good     SI2  4580.260870
12       Good     VS1  3801.445988
13       Good     VS2  4262.236196
14       Good    VVS1  2254.774194
15       Good    VVS2  3079.108392
16      Ideal      I1  4335.726027
17      Ideal      IF  2272.913366
18      Ideal     SI1  3752.118169
19      Ideal     SI2  4755.952656
20      Ideal     VS1  3489.744497
21      Ideal     VS2  3284.550385
22      Ideal    VVS1  2468.129458
23      Ideal    VVS2  3250.290100
24    Premium      I1  3947.331707
25    Premium      IF  3856.143478
26    Premium     SI1  4455.269371
27    Premium     SI2  5545.936928
28    Premium     VS1  4485.462041
29    Premium     VS2  4550.331248
30    Premium    VVS1  2831.206169
31    Premium    VVS2  3795.122989
32  Very Good      I1  4078.226190
33  Very Good      IF  4396.216418
34  Very Good     SI1  3932.391049
35  Very Good     SI2  4988.688095
36  Very Good     VS1  3805.353239
37  Very Good     VS2  4215.759552
38  Very Good    VVS1  2459.441065
39  Very Good    VVS2  3037.765182

In [22]:
dia_agg = dia.groupby(['cut', 'clarity'])['price'].mean().reset_index()
dia_agg.head(2)

    cut clarity        price
0  Fair      I1  3703.533333
1  Fair      IF  1912.333333

### sort_values()

In [25]:
dia_agg.sort_values('price').head() # 'price'를 기준으로 오름차순 정렬

          cut clarity        price
1        Fair      IF  1912.333333
14       Good    VVS1  2254.774194
17      Ideal      IF  2272.913366
38  Very Good    VVS1  2459.441065
22      Ideal    VVS1  2468.129458

In [26]:
dia_agg.sort_values('price', ascending = False).head() # 'price'를 기준으로 내림차순 정렬

          cut clarity        price
27    Premium     SI2  5545.936928
3        Fair     SI2  5173.916309
35  Very Good     SI2  4988.688095
19      Ideal     SI2  4755.952656
11       Good     SI2  4580.260870

In [28]:
dia_agg.sort_values(['cut', 'clarity'], ascending = [True, False]).head() 
# 'cut'은 오름차순, 'clarity'는 내림차순으로 정렬

    cut clarity        price
7  Fair    VVS2  3349.768116
6  Fair    VVS1  3871.352941
5  Fair     VS2  4174.724138
4  Fair     VS1  4165.141176
3  Fair     SI2  5173.916309

In [29]:
elec= pd.read_csv('elec_load_2017_7d.csv')
elec.head()

,YEAR,MONTH,DAY,X1HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,...,X15HR,X16HR,X17HR,X18HR,X19HR,X20HR,X21HR,X22HR,X23HR,X24HR
0,2017,1,1,60178,57862,56165,55135,54450,54401,54147,...,49213,49357,50362,53115,55205,55437,55348,55790,58195,59330
1,2017,1,2,57067,55148,53983,53571,54027,55388,57753,...,72228,71945,72641,73387,72294,69989,67893,66504,67435,69275
2,2017,1,3,66263,64233,63194,62461,62649,63396,65098,...,75576,75168,75791,75922,75469,73118,70769,68726,69593,71346
3,2017,1,4,68403,66143,65051,64245,64152,64678,66494,...,74977,74275,74909,75344,74504,71957,69715,68155,68948,70834
4,2017,1,5,68053,65801,64439,63437,63135,63250,63658,...,64767,63613,63095,63230,64253,63353,62455,62314,64350,66687

### melt()

In [32]:
elec_melt = elec.melt(id_vars = ['YEAR', 'MONTH', 'DAY'])
elec_melt # 'YEAR', 'MONTH', 'DAY' 만 col에 남기고 나머지 col을 melt시켜서 df안에 넣는다.

     YEAR  MONTH  DAY variable  value
0    2017      1    1     X1HR  60178
1    2017      1    2     X1HR  57067
2    2017      1    3     X1HR  66263
3    2017      1    4     X1HR  68403
4    2017      1    5     X1HR  68053
..    ...    ...  ...      ...    ...
163  2017      1    3    X24HR  71346
164  2017      1    4    X24HR  70834
165  2017      1    5    X24HR  66687
166  2017      1    6    X24HR  63214
167  2017      1    7    X24HR  69219

[168 rows x 5 columns]

### pivot()

In [36]:
elec_melt.pivot(index = ['YEAR', 'MONTH', 'DAY'], 
                columns = "variable",
               values = 'value').reset_index()

variable,YEAR,MONTH,DAY,X10HR,X11HR,X12HR,X13HR,X14HR,X15HR,X16HR,...,X23HR,X24HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,X8HR,X9HR
0,2017,1,1,49572,50034,50026,49515,49365,49213,49357,...,58195,59330,57862,56165,55135,54450,54401,54147,52467,50469
1,2017,1,2,70869,72867,73115,69165,71429,72228,71945,...,67435,69275,55148,53983,53571,54027,55388,57753,60781,66494
2,2017,1,3,75999,76522,76019,72203,74725,75576,75168,...,69593,71346,64233,63194,62461,62649,63396,65098,67745,72982
3,2017,1,4,76175,76375,75862,72288,74360,74977,74275,...,68948,70834,66143,65051,64245,64152,64678,66494,68851,73835
4,2017,1,5,66806,68030,67878,64439,64986,64767,63613,...,64350,66687,65801,64439,63437,63135,63250,63658,63441,65640
5,2017,1,6,55679,56548,56435,55563,55759,55408,55256,...,62288,63214,62010,60783,59779,59398,59296,58984,57533,56159
6,2017,1,7,75383,74984,74066,70335,72507,73064,72466,...,67697,69219,58974,57845,57387,57749,58794,60869,64665,71544

In [37]:
bike = pd.read_csv('bike.csv')
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [41]:
pd.crosstab(bike['holiday'], bike['workingday'], normalize = True)

workingday         0         1
holiday
0           0.290557  0.680875
1           0.028569  0.000000

In [52]:
dia = pd.read_csv('diamonds.csv')
dia.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [53]:
dia_cross = pd.crosstab(dia['cut'], dia['color']).reset_index()
dia_cross

color        cut     D     E     F     G     H     I    J
0           Fair   163   224   312   314   303   175  119
1           Good   662   933   909   871   702   522  307
2          Ideal  2834  3903  3826  4884  3115  2093  896
3        Premium  1603  2337  2331  2924  2360  1428  808
4      Very Good  1513  2400  2164  2299  1824  1204  678

In [56]:
dia_cross.melt(id_vars = 'cut').sort_values('value', ascending = False).head()

        cut color  value
17    Ideal     G   4884
7     Ideal     E   3903
12    Ideal     F   3826
22    Ideal     H   3115
18  Premium     G   2924

In [80]:
dia_price = dia.groupby(['cut', 'color'])[['price','carat']].mean().reset_index()
dia_price.head(10)

    cut color        price     carat
0  Fair     D  4291.061350  0.920123
1  Fair     E  3682.312500  0.856607
2  Fair     F  3827.003205  0.904712
3  Fair     G  4239.254777  1.023822
4  Fair     H  5135.683168  1.219175
5  Fair     I  4685.445714  1.198057
6  Fair     J  4975.655462  1.341176
7  Good     D  3405.382175  0.744517
8  Good     E  3423.644159  0.745134
9  Good     F  3495.750275  0.775930

In [82]:
dia_price['ratio'] = dia_price['price'] / dia_price['carat']
dia_price.head()

    cut color        price     carat        ratio
0  Fair     D  4291.061350  0.920123  4663.575143
1  Fair     E  3682.312500  0.856607  4298.717949
2  Fair     F  3827.003205  0.904712  4230.081128
3  Fair     G  4239.254777  1.023822  4140.618390
4  Fair     H  5135.683168  1.219175  4212.425219

In [83]:
dia_price.sort_values('ratio', ascending = False)

          cut color        price     carat        ratio
24    Premium     G  4500.742134  0.841488  5348.553755
17      Ideal     G  3720.706388  0.700715  5309.874382
23    Premium     F  4324.890176  0.827036  5229.388117
26    Premium     I  5946.180672  1.144937  5193.456761
16      Ideal     F  3374.939362  0.655829  5146.069664
25    Premium     H  5216.706780  1.016449  5132.285040
30  Very Good     F  3778.820240  0.740961  5099.889612
31  Very Good     G  3872.753806  0.766799  5050.548821
21    Premium     D  3631.292576  0.721547  5032.648015
33  Very Good     I  5255.879568  1.046952  5020.173260
28  Very Good     D  3470.467284  0.696424  4983.265477
32  Very Good     H  4535.390351  0.915948  4951.578090
22    Premium     E  3538.914420  0.717745  4930.601477
19      Ideal     I  4451.970377  0.913029  4876.044103
27    Premium     J  6294.591584  1.293094  4867.852836
18      Ideal     H  3889.334831  0.799525  4864.557602
10       Good     G  4123.482204  0.850896  4846.049951
12       Good     I  5078.532567  1.057222  4803.656658
29  Very Good     E  3214.652083  0.676317  4753.175904
11       Good     H  4276.254986  0.914729  4674.885539
0        Fair     D  4291.061350  0.920123  4663.575143
14      Ideal     D  2629.094566  0.565766  4646.967032
20      Ideal     J  4918.186384  1.063594  4624.121178
8        Good     E  3423.644159  0.745134  4594.669237
7        Good     D  3405.382175  0.744517  4573.950535
9        Good     F  3495.750275  0.775930  4505.241592
34  Very Good     J  5103.513274  1.133215  4503.568825
15      Ideal     E  2597.550090  0.578401  4490.913843
1        Fair     E  3682.312500  0.856607  4298.717949
2        Fair     F  3827.003205  0.904712  4230.081128
4        Fair     H  5135.683168  1.219175  4212.425219
13       Good     J  4574.172638  1.099544  4160.063396
3        Fair     G  4239.254777  1.023822  4140.618390
5        Fair     I  4685.445714  1.198057  3910.869980
6        Fair     J  4975.655462  1.341176  3709.918546

# 9차시 모평균 비교에 관한 가설검정 t-test

In [2]:
import pandas as pd
df = pd.read_csv('iris.csv')
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

### 단일 표본 t-검정(one sample t-test)

#### ttest_1samp()

In [3]:
df['Sepal.Length'].mean()

5.843333333333334

In [4]:
from scipy.stats import ttest_1samp
ttest_1samp(df["Sepal.Length"], popmean = 4)

Ttest_1sampResult(statistic=27.263680640799215, pvalue=8.764592435410748e-60)

In [106]:
result = ttest_1samp(df["Sepal.Length"], popmean = 4)
result

Ttest_1sampResult(statistic=27.263680640799215, pvalue=8.764592435410748e-60)

In [107]:
result[0]

27.263680640799215

In [108]:
round(result[0], 3)

27.264

In [119]:
stat, p = ttest_1samp(df["Sepal.Length"], popmean = 4)
print(round(stat, 3))
print(round(p, 3)) # p-value가 0.5 보다 작으면 귀무가설(표본평균과 모평균은 같다) 기각, 즉 같지않다.

27.264
0.0

In [120]:
stat, p = ttest_1samp(df["Sepal.Length"], popmean = 5.8)
print(round(stat, 3))
print(round(p, 3)) # p-value가 0.5 보다 크면 귀무가설(표본평균과 모평균은 같다) 채택, 즉 같다.

0.641
0.523

### 대응 표본 t-검정(paired sample t-test)

#### ttest_rel()

In [ ]:
from scipy.stats import ttest_rel

In [121]:
stat, p = ttest_rel(df["Sepal.Length"], df['Sepal.Width'])
print(round(stat, 3))
print(round(p, 3)) # p-value가 0.5 보다 작으면 귀무가설(독립적인 두 표표본은 평균이 같다.) 기각, 즉 같지않다.

34.815
0.0

In [122]:
df['Species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [125]:
stat, p = ttest_rel(df.loc[df['Species'] == "setosa", 'Petal.Length'],
                    df.loc[df['Species'] == "versicolor", 'Petal.Length'])
                    
print(round(stat, 3))
print(round(p, 3)) # p-value가 0.5 보다 작으면 귀무가설(독립적인 두 표표본은 평균이 같다.) 기각, 즉 같지않다.

-37.241
0.0

##### 문제

In [126]:
bike = pd.read_csv('bike.csv')
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [129]:
from scipy.stats import ttest_1samp
stat, p = ttest_1samp(bike['temp'], popmean = 20)
round(p, 3)

0.002

##### 문제

In [130]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [134]:
bike['datetime'].head(2)

0    2011-01-01 00:00:00
1    2011-01-01 01:00:00
Name: datetime, dtype: object

In [135]:
bike['datetime'] = pd.to_datetime(bike['datetime'])
bike['datetime'].head(2)

0   2011-01-01 00:00:00
1   2011-01-01 01:00:00
Name: datetime, dtype: datetime64[ns]

In [152]:
bike['month'] = bike['datetime'].dt.month
bike['year'] = bike['datetime'].dt.year

bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,month,year
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,1,2011
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,1,2011

In [168]:
bike_201101 = bike.loc[bike['month'] == 1 ]
bike_201101 = bike_201101[bike_201101['year'] == 2011]
bike_201101.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,month,year
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,1,2011
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,1,2011

In [169]:
bike_201101.tail(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,month,year
429,2011-01-19 22:00:00,1,0,1,1,12.3,15.150,52,11.0014,6,53,59,1,2011
430,2011-01-19 23:00:00,1,0,1,1,12.3,13.635,52,31.0009,1,27,28,1,2011

In [174]:
from scipy.stats import ttest_rel
stat, p = ttest_rel(bike_201101['casual'], bike_201101['registered'])
int(abs(stat))

21

##### 문제

In [175]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,month,year
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,1,2011
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,1,2011

In [180]:
bike_weeke = bike[bike['workingday'] == 0]
bike_weeke["workingday"].unique()

array([0])

In [181]:
bike_weekd = bike[bike['workingday'] == 1]
bike_weekd["workingday"].unique()

array([1])

In [184]:
from scipy.stats import ttest_ind
stat, p = ttest_ind(bike_weeke['registered'], bike_weekd['registered'])
int(abs(stat))

12

##### 다른 풀이

In [188]:
bike['wday'] = bike['datetime'].dt.weekday
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,month,year,wday
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,1,2011,5
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,1,2011,5

In [204]:
bike['wday'].unique()

array([5, 6, 0, 1, 2, 3, 4])

In [205]:
len(bike)

10886

In [207]:
bike['wend'] = (bike['wday'] >= 5) + 0 # 0, 1, 2, ... 순서대로 월, 화, 수, ... 
                                       # bool 값으로 나오므로  + 0을 하여 정수 변환
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,month,year,wday,wend
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,1,2011,5,1
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,1,2011,5,1

In [208]:
bike['wend'].unique()

array([1, 0])

In [210]:
stat, p = ttest_ind(bike.loc[bike['wend'] == 0, 'registered'],
                    bike.loc[bike['wend'] == 1, 'registered'])
int(abs(stat))

12

### 독립 2 표본 t-검정(independent 2 sample t-test)

#### ttest_ind()

In [ ]:
from scipy.stats import ttest_ind

# 10차시 모평균 비교에 관한 가설검정 : 일원 분산 분석(one-way ANOVA)

#### f_oneway()

In [211]:
import pandas as pd
from scipy.stats import f_oneway

In [212]:
df = pd.read_csv('diamonds.csv')
df.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [213]:
df['color'].unique()

array(['E', 'I', 'J', 'H', 'F', 'G', 'D'], dtype=object)

In [216]:
stat, p = f_oneway(df.loc[df['color'] == 'E', 'price'],
                   df.loc[df['color'] == 'I', 'price'],
                   df.loc[df['color'] == 'J', 'price'],
                  )
print(stat)
print(p)

621.8462321378724
7.006701786725582e-262

In [218]:
df.groupby('color')['price'].mean().reset_index()

  color        price
0     D  3169.954096
1     E  3076.752475
2     F  3724.886397
3     G  3999.135671
4     H  4486.669196
5     I  5091.874954
6     J  5323.818020

#### ols()

#### anova_lm()

In [226]:
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm

In [222]:
bike = pd.read_csv('bike.csv')
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [223]:
model = ols(formula = "temp ~ season", data = bike).fit() # season 변수를 명목형이 아닌 수치형으로 인식한다.

In [225]:
anova_lm(model)

               df         sum_sq       mean_sq           F         PR(>F)
season        1.0   44221.657301  44221.657301  780.591754  5.879560e-166
Residual  10884.0  616594.417651     56.651453         NaN            NaN

In [229]:
model = ols(formula = "temp ~C(season)", data = bike).fit() #C()로 season을 감싸주면 명목형으로 인삭한다.

In [230]:
anova_lm(model)

                df         sum_sq        mean_sq            F  PR(>F)
C(season)      3.0  412885.270005  137628.423335  6040.687453     0.0
Residual   10882.0  247930.804947      22.783570          NaN     NaN

#### pairwise_tukeyhsd()

In [ ]:
from statsmodels.stats.multicomp import pairwise_tukeyhsd

In [232]:
result = pairwise_tukeyhsd(bike['temp'], bike['season'])
print(result) # meandiff : 평균차이
                # p-adj : p-value
                # reject - True : 귀무가설 기각(두 그룹은 차이가 있다.)

 Multiple Comparison of Means - Tukey HSD, FWER=0.05
=====================================================
group1 group2 meandiff p-adj  lower    upper   reject
-----------------------------------------------------
     1      2   10.293 0.001   9.9598  10.6262   True
     1      3  16.2586 0.001  15.9254  16.5918   True
     1      4   4.1187 0.001   3.7856   4.4519   True
     2      3   5.9656 0.001   5.6339   6.2974   True
     2      4  -6.1742 0.001   -6.506  -5.8425   True
     3      4 -12.1399 0.001 -12.4716 -11.8081   True
-----------------------------------------------------

##### 문제

In [233]:
bike = pd.read_csv('bike.csv')
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [236]:
bike.groupby("season")['temp'].mean()

season
1    12.530491
2    22.823483
3    28.789111
4    16.649239
Name: temp, dtype: float64

In [241]:
from statsmodels.stats.anova import anova_lm
from statsmodels.formula.api import ols
model = ols(formula = "temp ~ C(season)", data = bike).fit()
anova_lm(model)

                df         sum_sq        mean_sq            F  PR(>F)
C(season)      3.0  412885.270005  137628.423335  6040.687453     0.0
Residual   10882.0  247930.804947      22.783570          NaN     NaN

#### 문제

In [244]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [245]:
bike['datetime'] = pd.to_datetime(bike['datetime'])
bike['datetime'].head(2)

0   2011-01-01 00:00:00
1   2011-01-01 01:00:00
Name: datetime, dtype: datetime64[ns]

In [247]:
bike['wday'] = bike['datetime'].dt.weekday
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,wday
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,5
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,5

In [248]:
bike['wday'].unique()

array([5, 6, 0, 1, 2, 3, 4])

In [249]:
from statsmodels.stats.multicomp import pairwise_tukeyhsd
result = pairwise_tukeyhsd(bike['registered'], bike['wday'])
print(result)

 Multiple Comparison of Means - Tukey HSD, FWER=0.05
======================================================
group1 group2 meandiff p-adj   lower    upper   reject
------------------------------------------------------
     0      1   6.1979    0.9  -9.7188  22.1146  False
     0      2    5.343    0.9 -10.5427  21.2287  False
     0      3  12.7424 0.2132  -3.1383   28.623  False
     0      4   6.2956    0.9  -9.6471  22.2384  False
     0      5 -27.5063  0.001 -43.3091 -11.7036   True
     0      6 -36.7583  0.001 -52.5734 -20.9431   True
     1      2  -0.8549    0.9 -16.7716  15.0618  False
     1      3   6.5445 0.8863  -9.3671  22.4561  False
     1      4   0.0977    0.9 -15.8759  16.0713  False
     1      5 -33.7042  0.001 -49.5381 -17.8704   True
     1      6 -42.9562  0.001 -58.8024 -27.1099   True
     2      3   7.3994 0.7916  -8.4813    23.28  False
     2      4   0.9526    0.9 -14.9901  16.8954  False
     2      5 -32.8493  0.001 -48.6521 -17.0466   True
     2      6 -42.1013  0.001 -57.9164 -26.2861   True
     3      4  -6.4467 0.8981 -22.3844   9.4909  False
     3      5 -40.2487  0.001 -56.0464 -24.4511   True
     3      6 -49.5006  0.001 -65.3107 -33.6906   True
     4      5  -33.802  0.001 -49.6621 -17.9419   True
     4      6 -43.0539  0.001 -58.9264 -27.1815   True
     5      6  -9.2519 0.5798 -24.9838   6.4799  False
------------------------------------------------------

In [254]:
(result.reject == False).sum()

11

# 11차시 모분산 비교에 관한 가설검정 : 등분산 검정(F-test of equality od varianced test)

### F-test

In [ ]:
# 두 집단의 등분산 검정(정규분포 가정)

In [3]:
import pandas as pd
from scipy.stats import f

In [6]:
df = pd.read_csv('financial_info_10k_persons.csv')
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65

In [8]:
ser_M = df.loc[df['Gender'] == 'M', 'Period_m']
ser_F = df.loc[df['Gender'] == 'F', 'Period_m']

In [9]:
ser_M

1       29
6       42
10      51
21      56
23      36
        ..
9993    44
9995    18
9996    36
9997    36
9998    36
Name: Period_m, Length: 4684, dtype: int64

In [10]:
ser_F

0       36
2       36
3       44
4       55
5       34
        ..
9986    40
9987    28
9992    40
9994    19
9999    36
Name: Period_m, Length: 5316, dtype: int64

In [14]:
F = ser_M.var() / ser_F.var() # 검정통계량 F
F

1.0404263453173155

In [15]:
result = f.cdf(F, dfd = len(ser_M) - 1, dfn = len(ser_F)) # 누적분포함수
result

0.9187893064994331

In [17]:
p = (1 - result) * 2 # p-value
p

0.16242138700113373

### Bartlett's test

In [ ]:
# 두 집단 이상의 등분산 검정(정규분포 가정)

In [4]:
from scipy.stats import bartlett

In [19]:
stat, p = bartlett(ser_M, ser_F)
print(stat)
print(p)

1.9563015878338914
0.16190940989175842

### Levene's test

In [2]:
# 두 집단 이상의 등분산 검정(정규분포 가정 필요없음)

In [5]:
from scipy.stats import levene

In [21]:
stat, p = levene(ser_M, ser_F)
print(stat)
print(p)

2.4640198991740747
0.11651198398605053

##### 문제

In [23]:
df = pd.read_csv('financial_info_10k_persons.csv')
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65

In [24]:
df['Mean_trans'] = df['Total_trans_amt'] / df['Total_trans_cnt']
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt,Mean_trans
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67,62.432836
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65,63.707692

In [25]:
df_m = df.loc[df['Gender'] == 'M', 'Mean_trans']
df_f = df.loc[df['Gender'] == 'F', 'Mean_trans']

In [26]:
from scipy.stats import f

In [28]:
F = df_m.var() / df_f.var() # 검정통계량
F

1.6665446172570897

In [30]:
result = f.cdf(F, len(df_m) - 1, len(df_f)) # 누적분포함수
result

0.9999999999999999

In [31]:
p = (1 - result) * 2
p

2.220446049250313e-16

##### 문제

In [32]:
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt,Mean_trans
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67,62.432836
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65,63.707692

In [33]:
df['Age'].min()

26

In [34]:
df['Age'].max()

73

In [35]:
df['Age_10'] = (df['Age'] // 10) * 10
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt,Mean_trans,Age_10
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67,62.432836,40
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65,63.707692,30

In [37]:
df_50 = df.loc[df['Age_10'] == 50, 'Mean_trans']
df_60 = df.loc[df['Age_10'] == 60, 'Mean_trans']
df_70 = df.loc[df['Age_10'] == 70, 'Mean_trans']

In [41]:
from scipy.stats import bartlett
stat, p = bartlett(df_50, df_60, df_70)
print(stat)
print(round(p, 3))

10.989031521668748
0.004

##### 문제

In [58]:
df_sub = df.loc[(df['Dependent_cnt'] == 0) & (df['Gender'] == 'M'), :]
df_sub.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt,Mean_trans,Age_10
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65,63.707692,30
26,27,0,32,M,0,College,Unknown,Less than $40K,Blue,36,3,3,4,3788.0,3975,65,61.153846,30

In [59]:
df['Edu_level'].unique()

array(['High School', 'Uneducated', 'Doctorate', 'Unknown', 'Graduate',
       'Post-Graduate', 'College'], dtype=object)

In [60]:
from scipy.stats import levene
stat, p = levene(df_sin.loc[df['Edu_level'] == df['Edu_level'].unique()[0], 'Mean_trans'],
       df_sin.loc[df['Edu_level'] == df['Edu_level'].unique()[1], 'Mean_trans'],
       df_sin.loc[df['Edu_level'] == df['Edu_level'].unique()[2], 'Mean_trans'],
       df_sin.loc[df['Edu_level'] == df['Edu_level'].unique()[3], 'Mean_trans'],
       df_sin.loc[df['Edu_level'] == df['Edu_level'].unique()[4], 'Mean_trans'],
       df_sin.loc[df['Edu_level'] == df['Edu_level'].unique()[5], 'Mean_trans'],
       df_sin.loc[df['Edu_level'] == df['Edu_level'].unique()[6], 'Mean_trans']
      )

print(stat)
print(round(p, 3))

0.8832361640792546
0.507

# 12차시 범주형 변수 간의 독립성 검정(Chi-squared test)

### chi2-contigency()

In [61]:
import pandas as pd
from scipy.stats import chi2_contingency
df = pd.read_csv('financial_info_10k_persons.csv')
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65

In [62]:
pd.crosstab(df['Gender'], df['Marital_status'])

Marital_status  Divorced  Married  Single  Unknown
Gender
F                    401     2432    2106      377
M                    338     2201    1783      362

In [68]:
chi2_contingency(pd.crosstab(df['Gender'], df['Marital_status'])) # 검정통계량, p-value, 자유도, 기대빈도

(4.093468963560284,
 0.2515464475739655,
 3,
 array([[ 392.8524, 2462.9028, 2067.3924,  392.8524],
        [ 346.1476, 2170.0972, 1821.6076,  346.1476]]))

In [70]:
stat, p, dof, e_val = chi2_contingency(pd.crosstab(df['Gender'], df['Marital_status'])) # 검정통계량, p-value, 자유도, 기대빈도
print(stat)
print(p)
print(dof)
print(e_val)

4.093468963560284
0.2515464475739655
3
[[ 392.8524 2462.9028 2067.3924  392.8524]
 [ 346.1476 2170.0972 1821.6076  346.1476]]

##### 문제

In [75]:
df = pd.read_csv('financial_info_10k_persons.csv')
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65

In [76]:
df_sub = df.loc[df['Edu_level'] == 'High School', ]
df_sub['Edu_level'].unique()

array(['High School'], dtype=object)

In [78]:
from scipy.stats import chi2_contingency
stat, p, dof, e_val = chi2_contingency(pd.crosstab(df_sub['Gender'], df_sub['is_attrited']), correction = False)
print(stat)
print(p)
print(dof)
print(e_val)

3.979589535548525
0.04605478481460392
1
[[867.82258065 152.17741935]
 [820.17741935 143.82258065]]

##### 문제

In [79]:
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65

In [80]:
from scipy.stats import chi2_contingency
stat, p, dof, e_val = chi2_contingency(pd.crosstab(df['Gender'], df['Card']))
print(stat)
print(p)
print(dof)
print(e_val)

66.45702170623164
2.4470625495771945e-14
3
[[4962.486    59.0076   10.632   283.8744]
 [4372.514    51.9924    9.368   250.1256]]

##### 문제

In [87]:
import numpy as np
df['card_act'] = np.where(df['Inactive_last_12m'] >= 3, 0, 1)
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt,card_act
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67,1
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65,0

In [88]:
df['card_act'].unique()

array([1, 0])

In [91]:
from scipy.stats import chi2_contingency
stat, p, dof, e_val = chi2_contingency(pd.crosstab(df['is_attrited'], df['card_act']))
print(stat)
print(p)
print(dof)
print(e_val)

210.74834292621756
9.431916381955241e-48
1
[[3805.5888 4606.4112]
 [ 718.4112  869.5888]]

# 13차시 상관분석

In [92]:
# 기울기에 상관없이 직선에 가까우면 상관계수의 절대값은 1에 가깝다.
# 상관계수가 0에 가까우면 두 변수간에 선형관계가 없을 뿐 관계가 전혀 없다고 할 순 없다.

### corr()

In [94]:
import pandas as pd
df = pd.read_csv('bike.csv')
df.corr()

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
season,1.000000,0.029368,-0.008126,0.008879,0.258689,0.264744,0.190610,-0.147121,0.096758,0.164011,0.163439
holiday,0.029368,1.000000,-0.250491,-0.007074,0.000295,-0.005215,0.001929,0.008409,0.043799,-0.020956,-0.005393
workingday,-0.008126,-0.250491,1.000000,0.033772,0.029966,0.024660,-0.010880,0.013373,-0.319111,0.119460,0.011594
weather,0.008879,-0.007074,0.033772,1.000000,-0.055035,-0.055376,0.406244,0.007261,-0.135918,-0.109340,-0.128655
temp,0.258689,0.000295,0.029966,-0.055035,1.000000,0.984948,-0.064949,-0.017852,0.467097,0.318571,0.394454
atemp,0.264744,-0.005215,0.024660,-0.055376,0.984948,1.000000,-0.043536,-0.057473,0.462067,0.314635,0.389784
humidity,0.190610,0.001929,-0.010880,0.406244,-0.064949,-0.043536,1.000000,-0.318607,-0.348187,-0.265458,-0.317371
windspeed,-0.147121,0.008409,0.013373,0.007261,-0.017852,-0.057473,-0.318607,1.000000,0.092276,0.091052,0.101369
casual,0.096758,0.043799,-0.319111,-0.135918,0.467097,0.462067,-0.348187,0.092276,1.000000,0.497250,0.690414
registered,0.164011,-0.020956,0.119460,-0.109340,0.318571,0.314635,-0.265458,0.091052,0.497250,1.000000,0.970948
count,0.163439,-0.005393,0.011594,-0.128655,0.394454,0.389784,-0.317371,0.101369,0.690414,0.970948,1.000000

In [96]:
df[['casual', 'registered', 'count']].corr()

              casual  registered     count
casual      1.000000    0.497250  0.690414
registered  0.497250    1.000000  0.970948
count       0.690414    0.970948  1.000000

In [97]:
df[['casual', 'registered', 'count']].corr(method = 'pearson')

              casual  registered     count
casual      1.000000    0.497250  0.690414
registered  0.497250    1.000000  0.970948
count       0.690414    0.970948  1.000000

In [98]:
df[['casual', 'registered', 'count']].corr(method = 'spearman')

              casual  registered     count
casual      1.000000    0.775785  0.847378
registered  0.775785    1.000000  0.988901
count       0.847378    0.988901  1.000000

In [99]:
df[['casual', 'registered', 'count']].corr(method = 'kendall')

              casual  registered     count
casual      1.000000    0.582213  0.666411
registered  0.582213    1.000000  0.919346
count       0.666411    0.919346  1.000000

### pearsonr()

In [100]:
from scipy.stats import pearsonr
pearsonr(df['casual'], df['registered'])

(0.4972496850870082, 0.0)

In [101]:
stat, p = pearsonr(df['casual'], df['registered'])
print(stat) # 상관계수
print(p)

0.4972496850870082
0.0

### spearmanr

In [102]:
from scipy.stats import spearmanr
spearmanr(df['casual'], df['registered'])

SpearmanrResult(correlation=0.775785305888168, pvalue=0.0)

### kendalltau()

In [103]:
from scipy.stats import kendalltau
kendalltau(df['casual'], df['registered'])

KendalltauResult(correlation=0.5822127999867908, pvalue=0.0)

##### 문제

In [104]:
df = pd.read_csv('bike.csv')
df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [109]:
df[['temp', 'atemp', 'humidity', 'casual']].corr()

              temp     atemp  humidity    casual
temp      1.000000  0.984948 -0.064949  0.467097
atemp     0.984948  1.000000 -0.043536  0.462067
humidity -0.064949 -0.043536  1.000000 -0.348187
casual    0.467097  0.462067 -0.348187  1.000000

In [111]:
df_corr = df[['temp', 'atemp', 'humidity', 'casual']].corr()
df_corr.min()

temp       -0.064949
atemp      -0.043536
humidity   -0.348187
casual     -0.348187
dtype: float64

##### 문제

In [112]:
df['season'].unique()

array([1, 2, 3, 4])

In [117]:
df_spr = df.loc[df['season'] == 1, ]
df_sum = df.loc[df['season'] == 2, ]
df_fal = df.loc[df['season'] == 3, ]
df_win = df.loc[df['season'] == 4, ]

print(df_spr[['atemp', 'casual']].corr())
print(df_sum[['atemp', 'casual']].corr())
print(df_fal[['atemp', 'casual']].corr())
print(df_win[['atemp', 'casual']].corr())

           atemp    casual
atemp   1.000000  0.478312
casual  0.478312  1.000000
           atemp    casual
atemp   1.000000  0.378122
casual  0.378122  1.000000
           atemp    casual
atemp   1.000000  0.381423
casual  0.381423  1.000000
           atemp    casual
atemp   1.000000  0.443751
casual  0.443751  1.000000

In [122]:
df.groupby('season')[['casual', 'atemp']].corr().round(3)

               casual  atemp
season
1      casual   1.000  0.478
       atemp    0.478  1.000
2      casual   1.000  0.378
       atemp    0.378  1.000
3      casual   1.000  0.381
       atemp    0.381  1.000
4      casual   1.000  0.444
       atemp    0.444  1.000

##### 문제

In [123]:
df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [125]:
df['weather'].unique()

array([1, 2, 3, 4])

In [126]:
df['weather_sub'] = np.where(df['weather'] == 1, 1, 0)
df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,weather_sub
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,1
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,1

In [134]:
df.iloc[500:, :]

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,weather_sub
500,2011-02-03 23:00:00,1,0,1,1,8.20,11.365,47,7.0015,4,34,38,1
501,2011-02-04 00:00:00,1,0,1,2,8.20,12.880,44,0.0000,3,10,13,0
502,2011-02-04 01:00:00,1,0,1,2,6.56,11.365,59,0.0000,0,7,7,0
503,2011-02-04 02:00:00,1,0,1,2,5.74,8.335,63,7.0015,0,1,1,0
504,2011-02-04 03:00:00,1,0,1,2,5.74,8.335,63,7.0015,0,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10881,2012-12-19 19:00:00,4,0,1,1,15.58,19.695,50,26.0027,7,329,336,1
10882,2012-12-19 20:00:00,4,0,1,1,14.76,17.425,57,15.0013,10,231,241,1
10883,2012-12-19 21:00:00,4,0,1,1,13.94,15.910,61,15.0013,4,164,168,1
10884,2012-12-19 22:00:00,4,0,1,1,13.94,17.425,61,6.0032,12,117,129,1
10885,2012-12-19 23:00:00,4,0,1,1,13.12,16.665,66,8.9981,4,84,88,1

In [128]:
df_sunnny = df.loc[df['weather_sub'] == 1, ]
df_notsunny = df.loc[df['weather_sub'] == 0, ]

In [130]:
df_sunnny[['temp', 'casual']].corr()

            temp    casual
temp    1.000000  0.471053
casual  0.471053  1.000000

In [132]:
df_notsunny[['temp', 'casual']].corr()

            temp    casual
temp    1.000000  0.446361
casual  0.446361  1.000000

In [135]:
0.471053- 0.446361

0.02469199999999999

In [139]:
df_corr = df.groupby('weather_sub')[['temp', 'casual']].corr().reset_index()
df_corr

   weather_sub level_1      temp    casual
0            0    temp  1.000000  0.446361
1            0  casual  0.446361  1.000000
2            1    temp  1.000000  0.471053
3            1  casual  0.471053  1.000000

In [145]:
abs(df_corr.iloc[1, 2] - df_corr.iloc[3, 2]).round(3)

0.025

# 14차시 단순회귀분석

### ols()

In [374]:
import pandas as pd
from statsmodels.formula.api import ols

In [375]:
df = pd.read_csv('iris.csv')
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [377]:
# model = ols(formula = "Sepal.Length ~ Sepal.Width", data = df).fit()

In [378]:
df.columns = ["SL", "SW", 'PL', 'PW', 'Species']
df.head(2)

    SL   SW   PL   PW Species
0  5.1  3.5  1.4  0.2  setosa
1  4.9  3.0  1.4  0.2  setosa

In [380]:
model = ols(formula = "SL ~ SW", data = df).fit()
model.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                     SL   R-squared:                       0.014
Model:                            OLS   Adj. R-squared:                  0.007
Method:                 Least Squares   F-statistic:                     2.074
Date:                Wed, 19 Jan 2022   Prob (F-statistic):              0.152
Time:                        13:57:05   Log-Likelihood:                -183.00
No. Observations:                 150   AIC:                             370.0
Df Residuals:                     148   BIC:                             376.0
Df Model:                           1
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept      6.5262      0.479     13.628      0.000       5.580       7.473
SW            -0.2234      0.155     -1.440      0.152      -0.530       0.083
==============================================================================
Omnibus:                        4.389   Durbin-Watson:                   0.952
Prob(Omnibus):                  0.111   Jarque-Bera (JB):                4.237
Skew:                           0.360   Prob(JB):                        0.120
Kurtosis:                       2.600   Cond. No.                         24.2
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

In [381]:
model = ols(formula = "PL ~ PW", data = df).fit()
model.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                     PL   R-squared:                       0.927
Model:                            OLS   Adj. R-squared:                  0.927
Method:                 Least Squares   F-statistic:                     1882.
Date:                Wed, 19 Jan 2022   Prob (F-statistic):           4.68e-86
Time:                        13:58:32   Log-Likelihood:                -101.18
No. Observations:                 150   AIC:                             206.4
Df Residuals:                     148   BIC:                             212.4
Df Model:                           1
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept      1.0836      0.073     14.850      0.000       0.939       1.228
PW             2.2299      0.051     43.387      0.000       2.128       2.332
==============================================================================
Omnibus:                        2.438   Durbin-Watson:                   1.430
Prob(Omnibus):                  0.295   Jarque-Bera (JB):                1.966
Skew:                           0.211   Prob(JB):                        0.374
Kurtosis:                       3.369   Cond. No.                         3.70
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

In [382]:
model.predict(df)

0      1.529546
1      1.529546
2      1.529546
3      1.529546
4      1.529546
         ...
145    6.212421
146    5.320445
147    5.543439
148    6.212421
149    5.097451
Length: 150, dtype: float64

In [383]:
df["pred"] = model.predict(df)
df.head()

    SL   SW   PL   PW Species      pred
0  5.1  3.5  1.4  0.2  setosa  1.529546
1  4.9  3.0  1.4  0.2  setosa  1.529546
2  4.7  3.2  1.3  0.2  setosa  1.529546
3  4.6  3.1  1.5  0.2  setosa  1.529546
4  5.0  3.6  1.4  0.2  setosa  1.529546

### LinearRegression()

In [384]:
from sklearn.linear_model import LinearRegression

In [387]:
model = LinearRegression().fit(X = df[["PL"]], # []로 묶어서 dataframe구조가 풀리지 않도록 한다.
                              y = df["PW"])
model

LinearRegression()

In [388]:
model.coef_

array([0.41575542])

In [389]:
model.intercept_

-0.3630755213190291

In [392]:
df['pred'] = model.predict(df[["PL"]]) # []로 묶어서 dataframe구조가 풀리지 않도록 한다.
df.head(2)

    SL   SW   PL   PW Species      pred
0  5.1  3.5  1.4  0.2  setosa  0.218982
1  4.9  3.0  1.4  0.2  setosa  0.218982

### mean_absolute_error

In [394]:
from sklearn.metrics import mean_absolute_error
mean_absolute_error(y_true = df['PL'], y_pred = df['pred'])

2.558666666666666

### mean_squared_error

In [396]:
from sklearn.metrics import mean_squared_error
MSE = mean_squared_error(y_true = df['PL'], y_pred = df['pred'])
MSE

7.603399357471673

In [397]:
RMSE = MSE ** 0.5
RMSE

2.7574262197693837

# 15차시 다중회귀분석

### dmatrices()

In [18]:
import pandas as pd
from patsy import dmatrices

In [19]:
df = pd.read_csv('bike.csv')
df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [20]:
df_sub = df.loc[:, "season" : "casual"]
df_sub.head(2)

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual
0,1,0,0,1,9.84,14.395,81,0.0,3
1,1,0,0,1,9.02,13.635,80,0.0,8

In [21]:
" casual ~ season + holiday + workingday + ... + windspeed"

' casual ~ season + holiday + workingday + ... + windspeed'

In [22]:
"casual ~ " + "season + holiday"

'casual ~ season + holiday'

#### .join()

In [23]:
"casual ~ " + " + ".join(df_sub.columns)

'casual ~ season + holiday + workingday + weather + temp + atemp + humidity + windspeed + casual'

In [24]:
"casual ~ " + " + ".join(df_sub.columns[:-1])

'casual ~ season + holiday + workingday + weather + temp + atemp + humidity + windspeed'

In [25]:
df_sub.head(2)

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual
0,1,0,0,1,9.84,14.395,81,0.0,3
1,1,0,0,1,9.02,13.635,80,0.0,8

In [26]:
formula = "casual ~ " + " + ".join(df_sub[:-1])
y, X = dmatrices(formula, data = df_sub, return_type = "dataframe")

In [27]:
y.head() # 종속변수 casual의 값

   casual
0     3.0
1     8.0
2     5.0
3     3.0
4     0.0

In [28]:
X.head() # 독립변수들의 값

,Intercept,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual
0,1.0,1.0,0.0,0.0,1.0,9.84,14.395,81.0,0.0,3.0
1,1.0,1.0,0.0,0.0,1.0,9.02,13.635,80.0,0.0,8.0
2,1.0,1.0,0.0,0.0,1.0,9.02,13.635,80.0,0.0,5.0
3,1.0,1.0,0.0,0.0,1.0,9.84,14.395,75.0,0.0,3.0
4,1.0,1.0,0.0,0.0,1.0,9.84,14.395,75.0,0.0,0.0

### variance_inflation_factor()

In [29]:
from statsmodels.stats.outliers_influence import variance_inflation_factor as vif

In [30]:
# 다중공선성 존재여부 검사
# 일반적으로 VIF가 10이상이면 다중공선성이 있는것으로 판단
df_vif = pd.DataFrame()
df_vif['colname'] = X.columns
df_vif['VIF'] = [vif(X.values, i) for i in range(X.shape[1])]
df_vif

# VIF_k(k번째 변수의 분산팽창요인) = 1 / (1 - R^2_K)
# R^2_k : 변수 k를 종속변수로 두고 나머지 변수들을 독립변수로하여 회귀분석을 했을 때 결정계수
# R^2_k가 크면 변수 k가 다른 독립변수에 의해 설명되는 설명력이 높다.
# 결정계수가 커지면 분상팽창계수의 분모가 작아져 결과적으로 분상팽창계수가 커진다.

# temp, atemp의 분산팽창계수가 높다.

      colname        VIF
0   Intercept  35.597708
1      season   1.140886
2     holiday   1.072926
3  workingday   1.285709
4     weather   1.239338
5        temp  35.592568
6       atemp  35.655135
7    humidity   1.644277
8   windspeed   1.195865
9      casual   1.782653

In [31]:
X.values

array([[ 1.    ,  1.    ,  0.    , ..., 81.    ,  0.    ,  3.    ],
       [ 1.    ,  1.    ,  0.    , ..., 80.    ,  0.    ,  8.    ],
       [ 1.    ,  1.    ,  0.    , ..., 80.    ,  0.    ,  5.    ],
       ...,
       [ 1.    ,  4.    ,  0.    , ..., 61.    , 15.0013,  4.    ],
       [ 1.    ,  4.    ,  0.    , ..., 61.    ,  6.0032, 12.    ],
       [ 1.    ,  4.    ,  0.    , ..., 66.    ,  8.9981,  4.    ]])

In [35]:
vif(X.values, 1)

1.1408860123518203

In [37]:
df_sub = df.loc[:, "season" : "casual"]
df_sub.head(2)

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual
0,1,0,0,1,9.84,14.395,81,0.0,3
1,1,0,0,1,9.02,13.635,80,0.0,8

In [55]:
df_sub = pd.concat([df.loc[:, "season" : "temp"],
                    df.loc[:, "humidity" : "casual"]],
                   axis = 1)
                
df_sub.head(2) # atemp 제거

   season  holiday  workingday  weather  temp  humidity  windspeed  casual
0       1        0           0        1  9.84        81        0.0       3
1       1        0           0        1  9.02        80        0.0       8

In [56]:
formula = "casual ~ " + " + ".join(df_sub[:-1])
y, X = dmatrices(formula, data = df_sub, return_type = "dataframe")

In [59]:
# 다중공선성 존재여부 검사
# 일반적으로 VIF가 10이상이면 다중공선성이 있는것으로 판단
df_vif = pd.DataFrame()
df_vif['colname'] = X.columns
df_vif['VIF'] = [vif(X.values, i) for i in range(X.shape[1])]
df_vif

# VIF_k(k번째 변수의 분산팽창요인) = 1 / (1 - R^2_K)
# R^2_k : 변수 k를 종속변수로 두고 나머지 변수들을 독립변수로하여 회귀분석을 했을 때 결정계수
# R^2_k가 크면 변수 k가 다른 독립변수에 의해 설명되는 설명력이 높다.
# 결정계수가 커지면 분상팽창계수의 분모가 작아져 결과적으로 분상팽창계수가 커진다.

# atemp를 제거하니 temp의 분산팽창계수가 작아짐
# 절편의 분산팽창계수는 신경쓸 필요 없음
# 다중공선성의 문제 해결됨

      colname        VIF
0   Intercept  33.166908
1      season   1.140653
2     holiday   1.071531
3  workingday   1.285626
4     weather   1.238251
5        temp   1.441426
6    humidity   1.636759
7   windspeed   1.149651
8      casual   1.777438

In [62]:
df.corr().round(2) # temp와 atemp의 상관계수가 0.98로 매우 높다.

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
season,1.00,0.03,-0.01,0.01,0.26,0.26,0.19,-0.15,0.10,0.16,0.16
holiday,0.03,1.00,-0.25,-0.01,0.00,-0.01,0.00,0.01,0.04,-0.02,-0.01
workingday,-0.01,-0.25,1.00,0.03,0.03,0.02,-0.01,0.01,-0.32,0.12,0.01
weather,0.01,-0.01,0.03,1.00,-0.06,-0.06,0.41,0.01,-0.14,-0.11,-0.13
temp,0.26,0.00,0.03,-0.06,1.00,0.98,-0.06,-0.02,0.47,0.32,0.39
atemp,0.26,-0.01,0.02,-0.06,0.98,1.00,-0.04,-0.06,0.46,0.31,0.39
humidity,0.19,0.00,-0.01,0.41,-0.06,-0.04,1.00,-0.32,-0.35,-0.27,-0.32
windspeed,-0.15,0.01,0.01,0.01,-0.02,-0.06,-0.32,1.00,0.09,0.09,0.10
casual,0.10,0.04,-0.32,-0.14,0.47,0.46,-0.35,0.09,1.00,0.50,0.69
registered,0.16,-0.02,0.12,-0.11,0.32,0.31,-0.27,0.09,0.50,1.00,0.97
count,0.16,-0.01,0.01,-0.13,0.39,0.39,-0.32,0.10,0.69,0.97,1.00

In [63]:
df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

### pd.get_dummies()

In [67]:
df_dum = pd.get_dummies(data = df, columns = ["season"], drop_first = True)
df_dum.head(2)

,datetime,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_2,season_3,season_4
0,2011-01-01 00:00:00,0,0,1,9.84,14.395,81,0.0,3,13,16,0,0,0
1,2011-01-01 01:00:00,0,0,1,9.02,13.635,80,0.0,8,32,40,0,0,0

##### 문제

In [194]:
df = pd.read_csv('diamonds.csv')
df.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [195]:
from patsy import dmatrix

In [196]:
formula = "price ~ carat + depth + table + x + y + z" 
formula

'price ~ carat + depth + table + x + y + z'

In [197]:
y, X = dmatrices(formula_like = formula, data = df, return_type = "dataframe")

In [198]:
y.head(2)

   price
0  326.0
1  326.0

In [199]:
X.head(2)

   Intercept  carat  depth  table     x     y     z
0        1.0   0.23   61.5   55.0  3.95  3.98  2.43
1        1.0   0.21   59.8   61.0  3.89  3.84  2.31

In [200]:
from statsmodels.stats.outliers_influence import variance_inflation_factor as vif

In [201]:
X.shape

(53940, 7)

In [202]:
df_vif = pd.DataFrame()
df_vif["colname"] = X.columns
df_vif["VIF"] = [vif(X.values, i) for i in range(len(df_vif))]
df_vif[df_vif["VIF"] >= 10]

     colname          VIF
0  Intercept  4821.696350
1      carat    21.602712
4          x    56.187704
5          y    20.454295
6          z    23.530049

In [203]:
df_vif['VIF'] = [vif(X.values, i) for i in range(X.shape[1])]

##### 문제

In [206]:
df = pd.read_csv('diamonds.csv')
df.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [207]:
from statsmodels.formula.api import ols
model = ols(formula = "price ~ carat + depth", data = df).fit()
model.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                  price   R-squared:                       0.851
Model:                            OLS   Adj. R-squared:                  0.851
Method:                 Least Squares   F-statistic:                 1.536e+05
Date:                Tue, 18 Jan 2022   Prob (F-statistic):               0.00
Time:                        23:05:00   Log-Likelihood:            -4.7249e+05
No. Observations:               53940   AIC:                         9.450e+05
Df Residuals:                   53937   BIC:                         9.450e+05
Df Model:                           2
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept   4045.3332    286.205     14.134      0.000    3484.368    4606.298
carat       7765.1407     14.009    554.282      0.000    7737.682    7792.599
depth       -102.1653      4.635    -22.041      0.000    -111.251     -93.080
==============================================================================
Omnibus:                    14148.858   Durbin-Watson:                   0.992
Prob(Omnibus):                  0.000   Jarque-Bera (JB):           148236.675
Skew:                           0.962   Prob(JB):                         0.00
Kurtosis:                      10.890   Cond. No.                     2.66e+03
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
[2] The condition number is large, 2.66e+03. This might indicate that there are
strong multicollinearity or other numerical problems.
"""

In [208]:
model.params

Intercept    4045.333183
carat        7765.140664
depth        -102.165322
dtype: float64

In [130]:
df["price_pred"] = model.predict(df)
df.head(2)

,carat,cut,color,clarity,depth,table,price,x,y,z,price_pred
0,0.23,Ideal,E,SI2,61.5,55.0,326,3.95,3.98,2.43,-451.851777
1,0.21,Premium,E,SI1,59.8,61.0,326,3.89,3.84,2.31,-433.473543

In [137]:
df.loc[(df["carat"] == 1) & (df["depth"] == 60) & (df["table"] == 55), :]

,carat,cut,color,clarity,depth,table,price,x,y,z,price_pred
12940,1.0,Very Good,G,VS2,60.0,55.0,5385,6.41,6.52,3.88,5680.554517

In [141]:
df_test = pd.DataFrame({"carat" : [1],
                       "depth" : [60],
                       "table" : [55]})
df_test

   carat  depth  table
0      1     60     55

In [142]:
model.predict(df_test)

0    5680.554517
dtype: float64

##### 문제

In [138]:
df = pd.read_csv('diamonds.csv')
df.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [153]:
df['color'].unique()

array(['E', 'I', 'J', 'H', 'F', 'G', 'D'], dtype=object)

In [169]:
df_dum = pd.get_dummies(data = df, columns = ["color"], drop_first = True)
df_dum.head(2)

,carat,cut,clarity,depth,table,price,x,y,z,color_E,color_F,color_G,color_H,color_I,color_J
0,0.23,Ideal,SI2,61.5,55.0,326,3.95,3.98,2.43,1,0,0,0,0,0
1,0.21,Premium,SI1,59.8,61.0,326,3.89,3.84,2.31,1,0,0,0,0,0

In [162]:
from statsmodels.formula.api import ols

In [170]:
formula = "price ~ carat + depth + " + " + ".join(df_dum.columns[-6 : ]) 
formula

'price ~ carat + depth + color_E + color_F + color_G + color_H + color_I + color_J'

In [171]:
model = ols(formula = formula, data = df_dum).fit()
model.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                  price   R-squared:                       0.865
Model:                            OLS   Adj. R-squared:                  0.865
Method:                 Least Squares   F-statistic:                 4.319e+04
Date:                Tue, 18 Jan 2022   Prob (F-statistic):               0.00
Time:                        21:48:17   Log-Likelihood:            -4.6977e+05
No. Observations:               53940   AIC:                         9.396e+05
Df Residuals:                   53931   BIC:                         9.396e+05
Df Model:                           8
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept   3399.1860    272.825     12.459      0.000    2864.447    3933.925
carat       8070.6389     13.988    576.983      0.000    8043.223    8098.055
depth        -89.7605      4.412    -20.344      0.000     -98.408     -81.113
color_E      -97.0161     23.164     -4.188      0.000    -142.417     -51.615
color_F      -80.8972     23.316     -3.470      0.001    -126.596     -35.199
color_G      -80.6971     22.585     -3.573      0.000    -124.963     -36.431
color_H     -720.8099     24.268    -29.703      0.000    -768.374    -673.245
color_I    -1043.9064     27.213    -38.361      0.000   -1097.243    -990.570
color_J    -1899.5248     33.657    -56.438      0.000   -1965.493   -1833.557
==============================================================================
Omnibus:                    12411.519   Durbin-Watson:                   0.953
Prob(Omnibus):                  0.000   Jarque-Bera (JB):           159901.705
Skew:                           0.746   Prob(JB):                         0.00
Kurtosis:                      11.302   Cond. No.                     2.67e+03
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
[2] The condition number is large, 2.67e+03. This might indicate that there are
strong multicollinearity or other numerical problems.
"""

In [172]:
df_test = pd.DataFrame({'carat' : [1],
                       'depth' : [50],
                       'color_E' : [1],
                       'color_F' : [0],
                       'color_G' : [0],
                       'color_H' : [0],
                       'color_I' : [0],
                       'color_J' : [0]})
df_test

   carat  depth  color_E  color_F  color_G  color_H  color_I  color_J
0      1     50        1        0        0        0        0        0

In [173]:
model.predict(df_test)

0    6884.782287
dtype: float64

In [176]:
df_dum['price_pred'] = model.predict(df_dum)
df_dum.head(2)

,carat,cut,clarity,depth,table,price,x,y,z,color_E,color_F,color_G,color_H,color_I,color_J,price_pred
0,0.23,Ideal,SI2,61.5,55.0,326,3.95,3.98,2.43,1,0,0,0,0,0,-361.855802
1,0.21,Premium,SI1,59.8,61.0,326,3.89,3.84,2.31,1,0,0,0,0,0,-370.675678

# 16차시 로지스틱 회귀분석

### Logit()

In [211]:
import pandas as pd
import numpy as np
from statsmodels.api import Logit

In [212]:
df = pd.read_csv('iris.csv')
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [235]:
df['Species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [214]:
df['is_setosa'] = np.where(df['Species'] == 'setosa', 1, 0)
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species  is_setosa
0           5.1          3.5           1.4          0.2  setosa          1
1           4.9          3.0           1.4          0.2  setosa          1

In [215]:
df["is_setosa"].unique()

array([1, 0])

In [216]:
model = Logit(endog = df['is_setosa'], # endog : 종속변수
             exog = df.iloc[:, :2]).fit() # exog : 독립변수
model

Optimization terminated successfully.
         Current function value: 0.036374
         Iterations 11

In [217]:
model.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                           Logit Regression Results
==============================================================================
Dep. Variable:              is_setosa   No. Observations:                  150
Model:                          Logit   Df Residuals:                      148
Method:                           MLE   Df Model:                            1
Date:                Tue, 18 Jan 2022   Pseudo R-squ.:                  0.9429
Time:                        23:06:46   Log-Likelihood:                -5.4560
converged:                       True   LL-Null:                       -95.477
Covariance Type:            nonrobust   LLR p-value:                 4.745e-41
================================================================================
                   coef    std err          z      P>|z|      [0.025      0.975]
--------------------------------------------------------------------------------
Sepal.Length    -7.5299      2.252     -3.343      0.001     -11.945      -3.115
Sepal.Width     13.1307      3.987      3.294      0.001       5.317      20.945
================================================================================

Possibly complete quasi-separation: A fraction 0.43 of observations can be
perfectly predicted. This might indicate that there is complete
quasi-separation. In this case some parameters will not be identified.
"""

In [218]:
model.params

Sepal.Length    -7.529945
Sepal.Width     13.130734
dtype: float64

In [219]:
model.pvalues

Sepal.Length    0.000828
Sepal.Width     0.000989
dtype: float64

In [222]:
model.tvalues

Sepal.Length   -3.343109
Sepal.Width     3.293594
dtype: float64

In [231]:
pred = model.predict(df.iloc[:, :2])
pred

0      9.994767e-01
1      9.238236e-01
2      9.986784e-01
3      9.976885e-01
4      9.999337e-01
           ...
145    1.575352e-05
146    4.509902e-07
147    7.102256e-05
148    1.149482e-01
149    6.467514e-03
Length: 150, dtype: float64

In [230]:
pd.Series(np.where(pred > 0.5, 1, 0))

0      1
1      1
2      1
3      1
4      1
      ..
145    0
146    0
147    0
148    0
149    0
Length: 150, dtype: int64

In [221]:
from sklearn.linear_model import LogisticRegression

In [236]:
model = LogisticRegression(random_state = 123).fit(X = df.iloc[:, :2],
                                                  y = df["is_setosa"])
model.coef_ # 회귀계수

array([[-3.38829757,  3.1645277 ]])

In [237]:
model.intercept_ # 절편

array([8.32330389])

In [247]:
pred = model.predict_proba(df.iloc[:, :2]) # 0이될 확률, 1이 될 확률
pred

array([[1.07279762e-01, 8.92720238e-01],
       [2.28953652e-01, 7.71046348e-01],
       [7.41382077e-02, 9.25861792e-01],
       [7.26167745e-02, 9.27383226e-01],
       [5.87390446e-02, 9.41260955e-01],
       [8.56334901e-02, 9.14366510e-01],
       [2.94111457e-02, 9.70588854e-01],
       [1.05155456e-01, 8.94844544e-01],
       [6.96599310e-02, 9.30340069e-01],
       [1.77893972e-01, 8.22106028e-01],
       [1.49917342e-01, 8.50082658e-01],
       [5.63129680e-02, 9.43687032e-01],
       [1.74644943e-01, 8.25355057e-01],
       [3.74273639e-02, 9.62572636e-01],
       [2.09277033e-01, 7.90722967e-01],
       [5.05015620e-02, 9.49498438e-01],
       [8.56334901e-02, 9.14366510e-01],
       [1.07279762e-01, 8.92720238e-01],
       [2.62074704e-01, 7.37925296e-01],
       [4.44385583e-02, 9.55561442e-01],
       [3.13051591e-01, 6.86948409e-01],
       [5.99885260e-02, 9.40011474e-01],
       [1.58371212e-02, 9.84162879e-01],
       [1.84533746e-01, 8.15466254e-01],
       [5.63129680e-02, 9.43687032e-01],
       [2.94132097e-01, 7.05867903e-01],
       [1.05155456e-01, 8.94844544e-01],
       [1.44302705e-01, 8.55697295e-01],
       [1.87924855e-01, 8.12075145e-01],
       [7.41382077e-02, 9.25861792e-01],
       [1.33598265e-01, 8.66401735e-01],
       [3.13051591e-01, 6.86948409e-01],
       [2.46331612e-02, 9.75366839e-01],
       [4.83982209e-02, 9.51601779e-01],
       [1.77893972e-01, 8.22106028e-01],
       [1.81190176e-01, 8.18809824e-01],
       [3.17883781e-01, 6.82116219e-01],
       [4.25764123e-02, 9.57423588e-01],
       [5.17409749e-02, 9.48259025e-01],
       [1.41561540e-01, 8.58438460e-01],
       [7.88799726e-02, 9.21120027e-01],
       [4.12321043e-01, 5.87678957e-01],
       [2.81601486e-02, 9.71839851e-01],
       [7.88799726e-02, 9.21120027e-01],
       [4.44385583e-02, 9.55561442e-01],
       [1.74644943e-01, 8.25355057e-01],
       [4.44385583e-02, 9.55561442e-01],
       [5.39813480e-02, 9.46018652e-01],
       [1.11641825e-01, 8.88358175e-01],
       [1.38863996e-01, 8.61136004e-01],
       [9.94874000e-01, 5.12600003e-03],
       [9.62141716e-01, 3.78582845e-02],
       [9.94758611e-01, 5.24138947e-03],
       [9.54083166e-01, 4.59168341e-02],
       [9.92154609e-01, 7.84539075e-03],
       [8.93719933e-01, 1.06280067e-01],
       [9.29565194e-01, 7.04348064e-02],
       [6.64739574e-01, 3.35260426e-01],
       [9.92326884e-01, 7.67311629e-03],
       [6.79531300e-01, 3.20468700e-01],
       [9.07972660e-01, 9.20273399e-02],
       [8.97896580e-01, 1.02103420e-01],
       [9.93596717e-01, 6.40328292e-03],
       [9.59619155e-01, 4.03808448e-02],
       [8.13669483e-01, 1.86330517e-01],
       [9.89730496e-01, 1.02695039e-02],
       [7.60892602e-01, 2.39107398e-01],
       [9.41837790e-01, 5.81622102e-02],
       [9.96738106e-01, 3.26189380e-03],
       [9.39337165e-01, 6.06628345e-02],
       [8.23633747e-01, 1.76366253e-01],
       [9.70247376e-01, 2.97526242e-02],
       [9.94009974e-01, 5.99002561e-03],
       [9.70247376e-01, 2.97526242e-02],
       [9.85001164e-01, 1.49988359e-02],
       [9.89500545e-01, 1.04994549e-02],
       [9.97146758e-01, 2.85324211e-03],
       [9.92495404e-01, 7.50459613e-03],
       [9.44241453e-01, 5.57585470e-02],
       [9.40599804e-01, 5.94001956e-02],
       [9.38049455e-01, 6.19505449e-02],
       [9.38049455e-01, 6.19505449e-02],
       [9.41837790e-01, 5.81622102e-02],
       [9.69594568e-01, 3.04054318e-02],
       [6.17728958e-01, 3.82271042e-01],
       [7.76795261e-01, 2.23204739e-01],
       [9.89730496e-01, 1.02695039e-02],
       [9.96810057e-01, 3.18994330e-03],
       [7.60892602e-01, 2.39107398e-01],
       [9.16904555e-01, 8.30954449e-02],
       [8.89393482e-01, 1.10606518e-01],
       [9.45407946e-01, 5.45920536e-02],
       [9.56936036e-01, 4.30639643e-02],
       [7.92452157e-01, 2.07547843e-01],
       [8.91575661e-01, 1.08424339e-01],
       [8.17038304e-01, 1.82961696e-01],
       [8.59707409e-01, 1.40292591e-01],
       [9.70886588e-01, 2.91134116e-02],
       [7.39947262e-01, 2.60052738e-01],
       [8.93719933e-01, 1.06280067e-01],
       [9.29565194e-01, 7.04348064e-02],
       [9.41837790e-01, 5.81622102e-02],
       [9.98053989e-01, 1.94601095e-03],
       [9.79078623e-01, 2.09213773e-02],
       [9.85328196e-01, 1.46718041e-02],
       [9.99641841e-01, 3.58159275e-04],
       [5.90984069e-01, 4.09015931e-01],
       [9.99278991e-01, 7.21008730e-04],
       [9.98448485e-01, 1.55151516e-03],
       [9.90807560e-01, 9.19244022e-03],
       [9.72725286e-01, 2.72747135e-02],
       [9.91978498e-01, 8.02150180e-03],
       [9.94640638e-01, 5.35936241e-03],
       [9.56004405e-01, 4.39955947e-02],
       [9.21878236e-01, 7.81217644e-02],
       [9.62141716e-01, 3.78582845e-02],
       [9.85328196e-01, 1.46718041e-02],
       [9.96799945e-01, 3.20005486e-03],
       [9.99928003e-01, 7.19969082e-05],
       [9.93596717e-01, 6.40328292e-03],
       [9.92821502e-01, 7.17849812e-03],
       [8.56986722e-01, 1.43013278e-01],
       [9.99864433e-01, 1.35566886e-04],
       [9.88779690e-01, 1.12203100e-02],
       [9.80835561e-01, 1.91644385e-02],
       [9.97390412e-01, 2.60958787e-03],
       [9.78615312e-01, 2.13846877e-02],
       [9.45407946e-01, 5.45920536e-02],
       [9.89025253e-01, 1.09747465e-02],
       [9.98612489e-01, 1.38751071e-03],
       [9.99625454e-01, 3.74546279e-04],
       [9.98372435e-01, 1.62756451e-03],
       [9.89025253e-01, 1.09747465e-02],
       [9.84666956e-01, 1.53330438e-02],
       [9.83976400e-01, 1.60236001e-02],
       [9.99744748e-01, 2.55251918e-04],
       [9.05815210e-01, 9.41847897e-02],
       [9.72125285e-01, 2.78747149e-02],
       [9.25041116e-01, 7.49588843e-02],
       [9.94758611e-01, 5.24138947e-03],
       [9.89730496e-01, 1.02695039e-02],
       [9.94758611e-01, 5.24138947e-03],
       [9.41837790e-01, 5.81622102e-02],
       [9.89955462e-01, 1.00445380e-02],
       [9.80835561e-01, 1.91644385e-02],
       [9.92495404e-01, 7.50459613e-03],
       [9.94009974e-01, 5.99002561e-03],
       [9.85328196e-01, 1.46718041e-02],
       [8.72666836e-01, 1.27333164e-01],
       [8.97896580e-01, 1.02103420e-01]])

In [248]:
pred[:, 1]

array([8.92720238e-01, 7.71046348e-01, 9.25861792e-01, 9.27383226e-01,
       9.41260955e-01, 9.14366510e-01, 9.70588854e-01, 8.94844544e-01,
       9.30340069e-01, 8.22106028e-01, 8.50082658e-01, 9.43687032e-01,
       8.25355057e-01, 9.62572636e-01, 7.90722967e-01, 9.49498438e-01,
       9.14366510e-01, 8.92720238e-01, 7.37925296e-01, 9.55561442e-01,
       6.86948409e-01, 9.40011474e-01, 9.84162879e-01, 8.15466254e-01,
       9.43687032e-01, 7.05867903e-01, 8.94844544e-01, 8.55697295e-01,
       8.12075145e-01, 9.25861792e-01, 8.66401735e-01, 6.86948409e-01,
       9.75366839e-01, 9.51601779e-01, 8.22106028e-01, 8.18809824e-01,
       6.82116219e-01, 9.57423588e-01, 9.48259025e-01, 8.58438460e-01,
       9.21120027e-01, 5.87678957e-01, 9.71839851e-01, 9.21120027e-01,
       9.55561442e-01, 8.25355057e-01, 9.55561442e-01, 9.46018652e-01,
       8.88358175e-01, 8.61136004e-01, 5.12600003e-03, 3.78582845e-02,
       5.24138947e-03, 4.59168341e-02, 7.84539075e-03, 1.06280067e-01,
       7.04348064e-02, 3.35260426e-01, 7.67311629e-03, 3.20468700e-01,
       9.20273399e-02, 1.02103420e-01, 6.40328292e-03, 4.03808448e-02,
       1.86330517e-01, 1.02695039e-02, 2.39107398e-01, 5.81622102e-02,
       3.26189380e-03, 6.06628345e-02, 1.76366253e-01, 2.97526242e-02,
       5.99002561e-03, 2.97526242e-02, 1.49988359e-02, 1.04994549e-02,
       2.85324211e-03, 7.50459613e-03, 5.57585470e-02, 5.94001956e-02,
       6.19505449e-02, 6.19505449e-02, 5.81622102e-02, 3.04054318e-02,
       3.82271042e-01, 2.23204739e-01, 1.02695039e-02, 3.18994330e-03,
       2.39107398e-01, 8.30954449e-02, 1.10606518e-01, 5.45920536e-02,
       4.30639643e-02, 2.07547843e-01, 1.08424339e-01, 1.82961696e-01,
       1.40292591e-01, 2.91134116e-02, 2.60052738e-01, 1.06280067e-01,
       7.04348064e-02, 5.81622102e-02, 1.94601095e-03, 2.09213773e-02,
       1.46718041e-02, 3.58159275e-04, 4.09015931e-01, 7.21008730e-04,
       1.55151516e-03, 9.19244022e-03, 2.72747135e-02, 8.02150180e-03,
       5.35936241e-03, 4.39955947e-02, 7.81217644e-02, 3.78582845e-02,
       1.46718041e-02, 3.20005486e-03, 7.19969082e-05, 6.40328292e-03,
       7.17849812e-03, 1.43013278e-01, 1.35566886e-04, 1.12203100e-02,
       1.91644385e-02, 2.60958787e-03, 2.13846877e-02, 5.45920536e-02,
       1.09747465e-02, 1.38751071e-03, 3.74546279e-04, 1.62756451e-03,
       1.09747465e-02, 1.53330438e-02, 1.60236001e-02, 2.55251918e-04,
       9.41847897e-02, 2.78747149e-02, 7.49588843e-02, 5.24138947e-03,
       1.02695039e-02, 5.24138947e-03, 5.81622102e-02, 1.00445380e-02,
       1.91644385e-02, 7.50459613e-03, 5.99002561e-03, 1.46718041e-02,
       1.27333164e-01, 1.02103420e-01])

In [244]:
np.where(pred > 0.5, 1, 0)

array([[0, 1],
       [0, 1],
       [0, 1]])

In [333]:
from sklearn.metrics import roc_auc_score # 분류값이 아닌 확률값을 넣어야한다.

In [252]:
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species  is_setosa
0           5.1          3.5           1.4          0.2  setosa          1
1           4.9          3.0           1.4          0.2  setosa          1

In [256]:
roc_auc_score(y_true = df['is_setosa'], y_score = pred[:, 1])
# 모델평가 : 1에 가까울수록 좋은 모델

0.9999999999999999

In [257]:
from sklearn.metrics import accuracy_score # 정확도 산출

In [264]:
pred[:5]

array([[0.10727976, 0.89272024],
       [0.22895365, 0.77104635],
       [0.07413821, 0.92586179],
       [0.07261677, 0.92738323],
       [0.05873904, 0.94126096]])

In [275]:
np.where(pred > 0.5, 1, 0)

array([[0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [0, 1],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0],
       [1, 0]])

In [274]:
accuracy_score(y_true = df["is_setosa"], y_pred = np.where(pred > 0.5, 1, 0)[:, 1])

1.0

In [276]:
accuracy_score(y_true = df["is_setosa"], y_pred = np.where(pred > 0.9, 1, 0)[:, 1])

0.8333333333333334

In [277]:
accuracy_score(y_true = df["is_setosa"], y_pred = np.where(pred > 0.8, 1, 0)[:, 1])

0.9466666666666667

In [258]:
from sklearn.metrics import precision_score # 정밀도 산출

In [278]:
precision_score(y_true = df["is_setosa"], y_pred = np.where(pred > 0.5, 1, 0)[:, 1])

1.0

In [259]:
from sklearn.metrics import recall_score # 재현율 산출

In [279]:
recall_score(y_true = df["is_setosa"], y_pred = np.where(pred > 0.5, 1, 0)[:, 1])

1.0

In [260]:
from sklearn.metrics import f1_score # f1값 산출

In [280]:
f1_score(y_true = df["is_setosa"], y_pred = np.where(pred > 0.5, 1, 0)[:, 1])

1.0

##### 문제

In [281]:
df = pd.read_csv('diabetes.csv')
df.head(2)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0

In [300]:
from sklearn.model_selection import train_test_split
df_train, df_test = train_test_split(df, train_size = 0.8, random_state = 123)

In [306]:
df_train.head(2)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome,Outcome_pred
318,3,115,66,39,140,38.1,0.150,28,0,0
313,3,113,50,10,85,29.5,0.626,25,0,0

In [301]:
from statsmodels.api import Logit

In [307]:
model = Logit(endog = df_train["Outcome"], exog = df_train.loc[:, ['BloodPressure', 
                                                       'Glucose', 
                                                       'BMI', 
                                                       'Insulin']]).fit()
model.summary()

Optimization terminated successfully.
         Current function value: 0.626579
         Iterations 5

<class 'statsmodels.iolib.summary.Summary'>
"""
                           Logit Regression Results
==============================================================================
Dep. Variable:                Outcome   No. Observations:                  614
Model:                          Logit   Df Residuals:                      610
Method:                           MLE   Df Model:                            3
Date:                Wed, 19 Jan 2022   Pseudo R-squ.:                 0.02458
Time:                        00:11:38   Log-Likelihood:                -384.72
converged:                       True   LL-Null:                       -394.41
Covariance Type:            nonrobust   LLR p-value:                 0.0002275
=================================================================================
                    coef    std err          z      P>|z|      [0.025      0.975]
---------------------------------------------------------------------------------
BloodPressure    -0.0265      0.005     -5.569      0.000      -0.036      -0.017
Glucose           0.0114      0.003      4.206      0.000       0.006       0.017
BMI              -0.0041      0.011     -0.376      0.707      -0.025       0.017
Insulin           0.0008      0.001      1.057      0.290      -0.001       0.002
=================================================================================
"""

In [308]:
df.head(2)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome,Outcome_pred
0,6,148,72,35,0,33.6,0.627,50,1,0
1,1,85,66,29,0,26.6,0.351,31,0,0

In [309]:
df_test['Outcome_pred'] = model.predict(df_test.loc[:, ['BloodPressure', 
                                                       'Glucose', 
                                                       'BMI', 
                                                       'Insulin']])
df_test['Outcome_pred'] = np.where(df_test['Outcome_pred'] > 0.5, 1, 0)
df_test.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome,Outcome_pred
236,7,181,84,21,192,35.9,0.586,51,1,0
395,2,127,58,24,275,27.7,1.600,25,0,1
36,11,138,76,0,0,33.2,0.420,35,0,0
210,2,81,60,22,0,27.7,0.290,25,0,0
483,0,84,82,31,125,38.2,0.233,23,0,0

In [310]:
from sklearn.metrics import accuracy_score
accuracy_score(y_true = df_test['Outcome'], y_pred = df_test['Outcome_pred'])

0.7012987012987013

##### 문제

In [311]:
df = pd.read_csv('diabetes.csv')
df.head(2)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0

In [312]:
from statsmodels.api import Logit

In [313]:
model = Logit(endog = df['Outcome'], exog = df.loc[:, ['Glucose', 'BMI', 'Age']]).fit()

Optimization terminated successfully.
         Current function value: 0.656276
         Iterations 4

In [315]:
model.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                           Logit Regression Results
==============================================================================
Dep. Variable:                Outcome   No. Observations:                  768
Model:                          Logit   Df Residuals:                      765
Method:                           MLE   Df Model:                            2
Date:                Wed, 19 Jan 2022   Pseudo R-squ.:                -0.01465
Time:                        00:15:04   Log-Likelihood:                -504.02
converged:                       True   LL-Null:                       -496.74
Covariance Type:            nonrobust   LLR p-value:                     1.000
==============================================================================
                 coef    std err          z      P>|z|      [0.025      0.975]
------------------------------------------------------------------------------
Glucose        0.0094      0.002      4.011      0.000       0.005       0.014
BMI           -0.0356      0.008     -4.447      0.000      -0.051      -0.020
Age           -0.0129      0.006     -2.056      0.040      -0.025      -0.001
==============================================================================
"""

In [316]:
model.params

Glucose    0.009368
BMI       -0.035639
Age       -0.012898
dtype: float64

In [318]:
np.exp(model.params) # odds ratio(승산비)

Glucose    1.009412
BMI        0.964989
Age        0.987184
dtype: float64

##### 문제

In [321]:
df = pd.read_csv('diabetes.csv')
df.head(2)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0

In [330]:
from statsmodels.api import Logit
model = Logit(endog = df['Outcome'], exog = df.loc[:, ['Glucose', 'BMI', 'Age']]).fit()

Optimization terminated successfully.
         Current function value: 0.656276
         Iterations 4

In [331]:
df['Outcome_pred'] = model.predict(df.loc[:, ['Glucose', 'BMI', 'Age']])
# df['Outcome_pred'] = np.where(df['Outcome_pred'] > 0.5, 1, 0)
df.head(2)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome,Outcome_pred
0,6,148,72,35,0,33.6,0.627,50,1,0.387961
1,1,85,66,29,0,26.6,0.351,31,0,0.365506

In [332]:
from sklearn.metrics import roc_auc_score
roc_auc_score(y_true = df['Outcome'], y_score = df["Outcome_pred"])

0.5414253731343283

# 17차시 의사결정나무 모델 : 분류 및 회귀나무

In [334]:
# 종속변수가 명목형인 경우

### DecisionTreeClassifier()

In [335]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier

In [337]:
df = pd.read_csv('iris.csv')
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [338]:
import numpy as np
df['is_setosa'] = np.where(df['Species'] == 'setosa', 1, 0)
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species  is_setosa
0           5.1          3.5           1.4          0.2  setosa          1
1           4.9          3.0           1.4          0.2  setosa          1

In [339]:
df['is_setosa'].unique()

array([1, 0])

In [342]:
model_c = DecisionTreeClassifier(random_state = 123).fit(X = df.iloc[:, :4],
                                                        y = df["is_setosa"])
model_c

DecisionTreeClassifier(random_state=123)

In [346]:
pred_c = model_c.predict(df.iloc[:, :4])
pred_c[:5]

array([1, 1, 1, 1, 1])

In [349]:
pred_c = model_c.predict_proba(df.iloc[:, :4])
pred_c[:5]

array([[0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.]])

In [345]:
df["is_setosa_pred"] = model_c.predict(df.iloc[:, :4])
df.head(2)

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_pred
0,5.1,3.5,1.4,0.2,setosa,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1

### DecisionTreeRegressor()

In [336]:
from sklearn.tree import DecisionTreeRegressor

In [350]:
df.head(2)

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_pred
0,5.1,3.5,1.4,0.2,setosa,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1

In [351]:
model_r = DecisionTreeRegressor(random_state = 123).fit(X = df.iloc[:, :3],
                                                       y = df["Petal.Width"])
model_r

DecisionTreeRegressor(random_state=123)

In [352]:
pred_r = model_r.predict(df.iloc[:, :3])
pred_r

array([0.25, 0.2 , 0.2 , 0.2 , 0.2 , 0.4 , 0.3 , 0.2 , 0.2 , 0.15, 0.2 ,
       0.2 , 0.2 , 0.1 , 0.2 , 0.4 , 0.4 , 0.25, 0.3 , 0.3 , 0.2 , 0.4 ,
       0.2 , 0.5 , 0.2 , 0.2 , 0.4 , 0.2 , 0.2 , 0.2 , 0.2 , 0.4 , 0.1 ,
       0.2 , 0.15, 0.2 , 0.2 , 0.1 , 0.2 , 0.2 , 0.3 , 0.3 , 0.2 , 0.6 ,
       0.4 , 0.2 , 0.2 , 0.2 , 0.2 , 0.2 , 1.4 , 1.5 , 1.5 , 1.3 , 1.5 ,
       1.3 , 1.6 , 1.  , 1.3 , 1.4 , 1.  , 1.5 , 1.  , 1.4 , 1.3 , 1.4 ,
       1.5 , 1.  , 1.5 , 1.1 , 1.8 , 1.3 , 1.5 , 1.2 , 1.3 , 1.4 , 1.4 ,
       1.7 , 1.5 , 1.  , 1.1 , 1.  , 1.2 , 1.6 , 1.5 , 1.6 , 1.5 , 1.3 ,
       1.3 , 1.3 , 1.2 , 1.4 , 1.2 , 1.  , 1.3 , 1.2 , 1.3 , 1.3 , 1.1 ,
       1.3 , 2.5 , 1.9 , 2.1 , 1.8 , 2.2 , 2.1 , 1.7 , 1.8 , 1.8 , 2.5 ,
       2.  , 1.9 , 2.1 , 2.  , 2.4 , 2.3 , 1.8 , 2.2 , 2.3 , 1.5 , 2.3 ,
       2.  , 2.  , 1.8 , 2.3 , 1.8 , 1.8 , 1.8 , 2.15, 1.6 , 1.9 , 2.  ,
       2.15, 1.5 , 1.4 , 2.3 , 2.4 , 1.8 , 1.8 , 2.1 , 2.4 , 2.3 , 1.9 ,
       2.3 , 2.3 , 2.3 , 1.9 , 2.  , 2.3 , 1.8 ])

In [353]:
df['Petal.Width_pred'] = model_r.predict(df.iloc[:, :3])
df.head(2)

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_pred,Petal.Width_pred
0,5.1,3.5,1.4,0.2,setosa,1,1,0.25
1,4.9,3.0,1.4,0.2,setosa,1,1,0.20

##### 문제

In [354]:
df = pd.read_csv('diabetes.csv')
df.head(2)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0

In [355]:
from sklearn.model_selection import train_test_split
df_train, df_test = train_test_split(df, train_size = 0.8, random_state = 123)

In [356]:
from sklearn.tree import DecisionTreeClassifier

In [360]:
model_c = DecisionTreeClassifier(random_state = 123).fit(X = df_train.loc[:, ['Glucose', 'BloodPressure', 'Pregnancies']],
                                                        y = df_train['Outcome'])

In [363]:
df_test['Outcome_pred'] = model_c.predict(df_test.loc[:, ['Glucose', 'BloodPressure', 'Pregnancies']])
df_test.head(2)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome,Outcome_pred
236,7,181,84,21,192,35.9,0.586,51,1,1
395,2,127,58,24,275,27.7,1.600,25,0,0

In [364]:
from sklearn.metrics import accuracy_score
accuracy_score(y_true = df_test['Outcome'], y_pred = df_test['Outcome_pred'])

0.6298701298701299

##### 문제

In [365]:
df = pd.read_csv('diabetes.csv')
df.head(2)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0

In [366]:
from sklearn.model_selection import train_test_split

In [367]:
df_train, df_test = train_test_split(df, train_size = 0.8, random_state = 123)

In [368]:
from sklearn.tree import DecisionTreeRegressor

In [369]:
model_r = DecisionTreeRegressor(random_state = 123).fit(X = df_train.loc[:, ['Glucose', 'BloodPressure', 'SkinThickness']],
                                                       y = df_train['BMI'])
model_r

DecisionTreeRegressor(random_state=123)

In [373]:
df_test['BMI_pred'] = model_r.predict(X = df_test.loc[:, ['Glucose', 'BloodPressure', 'SkinThickness']],)
df_test.head(2)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome,BMI_pred
236,7,181,84,21,192,35.9,0.586,51,1,30.8
395,2,127,58,24,275,27.7,1.600,25,0,28.6

In [398]:
from sklearn.metrics import mean_squared_error
MSE = mean_squared_error(y_true = df_test['BMI'], y_pred = df_test["BMI_pred"])
MSE

98.4977886002886

In [399]:
MSE ** 0.5

9.924605211306321

##### 문제

In [400]:
df = pd.read_csv('diabetes.csv')
df.head(2)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0

In [401]:
from sklearn.model_selection import train_test_split

In [402]:
df_train, df_test = train_test_split(df, train_size = 0.7, random_state = 345)

In [403]:
from sklearn.tree import DecisionTreeClassifier

In [408]:
model_c = DecisionTreeClassifier(random_state = 345, max_depth = 3).fit(X = df_train.loc[:, ['Glucose', 'BloodPressure', 'Pregnancies', 'BMI', 'Age']],
                                      y = df_train["Outcome"])

In [409]:
df_test["Outcome_pred"] = model_c.predict(df_test.loc[:, ['Glucose', 'BloodPressure', 'Pregnancies', 'BMI', 'Age']])
df_test.head(2)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome,Outcome_pred
320,4,129,60,12,231,27.5,0.527,31,0,0
65,5,99,74,27,0,29.0,0.203,32,0,0

In [410]:
from sklearn.metrics import accuracy_score
accuracy_score(y_true = df_test['Outcome'], y_pred = df_test['Outcome_pred'])

0.7705627705627706

In [411]:
model_c = DecisionTreeClassifier(random_state = 345, max_depth = 4).fit(X = df_train.loc[:, ['Glucose', 'BloodPressure', 'Pregnancies', 'BMI', 'Age']],
                                      y = df_train["Outcome"])
df_test["Outcome_pred"] = model_c.predict(df_test.loc[:, ['Glucose', 'BloodPressure', 'Pregnancies', 'BMI', 'Age']])
df_test.head(2)
from sklearn.metrics import accuracy_score
accuracy_score(y_true = df_test['Outcome'], y_pred = df_test['Outcome_pred'])

0.7575757575757576

In [412]:
model_c = DecisionTreeClassifier(random_state = 345, max_depth = 5).fit(X = df_train.loc[:, ['Glucose', 'BloodPressure', 'Pregnancies', 'BMI', 'Age']],
                                      y = df_train["Outcome"])
df_test["Outcome_pred"] = model_c.predict(df_test.loc[:, ['Glucose', 'BloodPressure', 'Pregnancies', 'BMI', 'Age']])
df_test.head(2)
from sklearn.metrics import accuracy_score
accuracy_score(y_true = df_test['Outcome'], y_pred = df_test['Outcome_pred'])

0.7575757575757576

In [413]:
model_c = DecisionTreeClassifier(random_state = 345, max_depth = 6).fit(X = df_train.loc[:, ['Glucose', 'BloodPressure', 'Pregnancies', 'BMI', 'Age']],
                                      y = df_train["Outcome"])
df_test["Outcome_pred"] = model_c.predict(df_test.loc[:, ['Glucose', 'BloodPressure', 'Pregnancies', 'BMI', 'Age']])
df_test.head(2)
from sklearn.metrics import accuracy_score
accuracy_score(y_true = df_test['Outcome'], y_pred = df_test['Outcome_pred'])

0.7705627705627706